{
  "_header": {
    "version": "3.0",
    "article_id": "221d2154510e",
    "state": "COLLECTED",
    "state_history": [
      {
        "state": "COLLECTED",
        "at": "2025-12-29T22:50:13.772650+09:00",
        "by": "crawler"
      }
    ]
  },
  "_original": {
    "title": "One in five YouTube Shorts shown to new users is AI-generated slop, study finds",
    "description": "A recent study shows that low-quality AI videos are already a million-dollar industry firmly embedded in YouTube's daily feed. Set up a fresh account today, and one in five Shorts will be AI slop. And the technology is just getting started.",
    "image": "https://the-decoder.com/wp-content/uploads/2025/12/youtube_neura_network_illustration-2.png",
    "text": "Ask about this article… Search A new analysis from video tool Kapwing shows how deeply low-quality AI content has infiltrated YouTube's trending lists, especially Shorts. Kapwing, a company that makes AI-powered video tools, set out to measure how much AI slop has taken over YouTube. The study defines AI slop as \"carelessly produced, low-quality content generated using automated applications to farm views and subscribers or influence political opinions.\" The related term \"brainrot\" refers to pointless, repetitive content that grabs attention through quick cuts, bright colors, and absurd scenes without saying anything. Kapwing identified the 100 most-watched trending channels in each country and tracked their views, subscriber counts, and estimated annual revenue. Spain's AI slop channels have a combined 20.22 million subscribers, more than any other country, despite having just eight such channels. That's far fewer than Pakistan (20), Egypt (14), or South Korea (11). Ad South Korea takes the lead in views: the country's eleven trending slop channels have racked up 8.45 billion views, almost 1.6 times more than second-place Pakistan (5.34 billion) and 2.5 times more than the US (3.39 billion). The US ranks third with 14.47 million slop subscribers, followed by Brazil with 12.56 million. Ad DEC_D_Incontent-1 Top channels rake in millions The channel with the most views worldwide is \"Bandar Apna Dost\" from India with 2.07 billion views. Its 500-plus videos feature \"a realistic monkey in hilarious, dramatic, and heart-touching human-style situations,\" many of them variations of identical scenarios. Estimated annual revenue: $4.25 million. The subscriber crown goes to the US Spanish-language channel \"Cuentos Facinantes\" with 5.95 million followers. The channel launched in 2020, but its oldest currently available video dates to January 8, 2025, and features low-quality Dragon Ball content. Ad Spanish channel \"Imperio de jesus\" comes in second with 5.87 million subscribers. It promises to \"strengthen faith in Jesus through entertaining interactive quizzes\" and pits the \"Son of God\" against Satan or the Grinch in either/or scenarios. South Korean channel \"Three Minutes Wisdom\" has 2.02 billion views and an estimated annual revenue of $4 million. Its 140 videos show photorealistic scenes of cute pets defeating wild animals. Other examples highlight the breadth of the slop industry: \"Pouty Frenchie\" from Singapore has 2 billion views and appears aimed at children: a French Bulldog drives through candy forests and eats crystal sushi, accompanied by children's laughter. Ad DEC_D_Incontent-2 \"The AI World\" from Pakistan shows AI-generated shorts of catastrophic floods with titles like \"Poor People, Poor Family.\" The channel covered similar themes before the AI boom but used authentic footage back then and still pulled millions of views. Those videos still get published, but they don't get nearly the same reach as the brainrot shorts, which appear optimized for sensationalism. Ad According to Max Read (via The Guardian), a journalist who has written extensively on AI slop, most slop producers come from middle-income countries where median wages fall below potential YouTube earnings: Ukraine, India, Kenya, Nigeria, Brazil, and Vietnam. One in five Shorts is AI-generated Kapwing also created a fresh YouTube account and documented the first 500 Shorts in the feed. The findings: 33 percent of videos qualified as brainrot, and 21 percent (104 videos) were AI-generated. The first 16 videos were clean, but the proportion climbed steadily after that. Only Google can say whether this frequency stems from YouTube's algorithm or simply reflects the sheer volume of slop being uploaded, Kapwing notes. A Guardian analysis from August found that nearly one in ten of the fastest-growing YouTube channels worldwide posts exclusively AI-generated content. Established platforms face a tough choice on AI content The study shows that platforms like YouTube face a fundamental decision. Option one: stricter regulation of AI-generated content—mandatory labeling, algorithmic demotion, or cutting monetization for pure slop channels. But this could stifle AI innovation and raises tricky questions: Where does legitimate AI use end and slop begin? Detecting AI-generated content is also a hard technical problem, especially when only parts of a video are synthetic. Option two: maintain the status quo, where the algorithm rewards engagement over quality. The short-term benefits are clear: more watch time, more ad revenue. And just as Google now uses other people's content to answer search queries directly, the company could eventually produce engagement-farming AI slop itself, cutting out creators and keeping more ad revenue. Over time, though, platforms risk alienating both users and advertisers. \"Generative AI is a tool, and like any tool it can be used to make both high- and low-quality content. We remain focused on connecting our users with high-quality content, regardless of how it was made,\" a YouTube spokesperson told The Guardian. There's also a third possibility: new platforms could emerge to fill the growing demand for authentic, human-made content. One example is DiVine, a reboot of the earlier Vine platform that explicitly bans AI and markets itself as purely human. If trust in established platforms keeps eroding, these alternatives could become more appealing, both for creators trying to stand out from the slop flood and for users hungry for authentic content. Still, seriously threatening the dominance of Google, Meta, and others would take a lot.",
    "published_at": "2025-12-29T12:06:47+00:00",
    "url": "https://the-decoder.com/one-in-five-youtube-shorts-shown-to-new-users-is-ai-generated-slop-study-finds/",
    "source_id": "the_decoder",
    "crawled_at": "2025-12-29T22:50:13.772650+09:00"
  },
  "_analysis": {},
  "_classification": {},
  "_publication": {}
}