{
  "title": "웨이모, 로보택시 정전으로 SW 업데이트...'제미나이' 통합도 실험 - AI타임스",
  "description": "구글의 자율주행 자회사 웨이모가 최근 샌프란시스코 대규모 정전 사태로 로보택시가 교차로에 멈춰 섰던 문제를 해결하기 위해 소프트웨어 업데이트를 배포했다. 웨이모는",
  "image": "https://cdn.aitimes.com/news/photo/202512/205089_206576_2218.png",
  "text": "(사진=웨이모) 구글의 자율주행 자회사 웨이모가 최근 샌프란시스코 대규모 정전 사태로 로보택시가 교차로에 멈춰 섰던 문제를 해결하기 위해 소프트웨어 업데이트를 배포했다. 웨이모는 23일(현지시간) 공식 블로그를 통해 “정전으로 신호등이 작동하지 않을 때 로보택시가 단호하게 주행 판단을 내릴 수 있도록 자율주행 소프트웨어를 개선하고 있다”라고 발표했다. 지난 주말 샌프란시스코 전역에서 발생한 정전 당시, 다수의 웨이모 차량이 교차로에서 정체를 빚는 장면이 소셜 미디어에 퍼져나가며 논란이 된 바 있다. 자율주행의 한계를 보여줬다는 말도 나왔다. 웨이모는 이번 사태가 정전으로 인해 한꺼번에 많은 원격 요청이 몰린 탓이라고 설명했다. 신호등이 꺼지면 인간 운전자처럼 사거리에서 일시 정지한 것은 문제가 아니라는 것이다. 하지만, 당시에는 많은 로보택시가 주변의 혼란스럽거나 예상치 못한 상황을 감지하고 “지금 판단이 맞는지”를 확인하기 위해 원격 대응팀에 확인 요청을 보냈고, 요청이 한꺼번에 몰리며 대응이 늦어졌다는 내용이다. 웨이모는 이런 확인 요청 시스템이 초기 상용화 단계에서 안전을 최우선으로 고려해 도입된 장치라며, 현재 차량 운행 규모에 맞춰 조정하고 있다고 밝혔다. 따라서 이번 업데이트에는 자율주행 소프트웨어에 정전 상황에 대한 맥락 정보를 더 많이 제공, 차량이 스스로 신속하게 판단하도록 하는 내용이 포함된다. 또 이번 사태에서 얻은 교훈을 반영해 비상 대응 프로토콜도 개선할 예정이다. 논란과 달리, 정전 당시 로보택시가 작동하지 않는 신호등 7000곳 이상을 성공적으로 통과했다고 강조했다. “이 정도 규모의 사건은 자율주행 기술에 독특한 도전 과제였다”라고 설명했다. 하지만, 전문가들은 이번 사례가 대규모 무인 차량 운영 과정에서 여전히 예기치 못한 문제가 숨겨져 있다는 것을 보여준 것으로 분석했다. 웨이모는 과거에도 정차 중인 스쿨버스를 인식하고 기다리도록 는 소프트웨어 업데이트를 여러 차례 진행했으며, 이 과정에서 미국 도로교통안전국(NHTSA)의 조사와 리콜을 겪은 바 있다. 한편, 웨이모가 로보택시에 구글의 '제미나이'를 AI 비서로 탑재하는 테스트 중이라는 정황도 포착됐다. 앱 분석 연구자인 제인 만천 웡은 웨이모 모바일 앱 코드에서 ‘웨이모 라이드 어시스턴트 메타 프롬프트’라는 내부 문서를 발견했다고 최근 밝혔다. 1200줄이 넘는 이 문서는 제미나이가 로보택시 안에서 어떻게 행동해야 하는지를 상세히 규정하고 있다. 이 AI 비서는 단순한 챗봇을 넘어, 탑승객의 질문에 답하고 차량 내 온도·조명·음악 등 일부 기능을 제어하며 필요할 경우 이용자를 안심시키는 역할을 맡도록 설계된 것으로 전해졌다. 반면, 주행 경로 변경이나 좌석 조정, 창문 조작 등 물리적인 조작은 제외돼 있다. 특히, 제미나이는 자율주행 시스템인 ‘웨이모 드라이버’와 정체성을 명확하게 구분하도록 지정됐다. “도로를 어떻게 인식하느냐”는 질문에는 “내가 센서를 사용한다”가 아니라, “웨이모 드라이버가 센서를 사용한다”라고 답해야 한다. 또 실시간 주행 판단이나 사고 영상 등 민감한 사안에 대해서는 대화를 회피하도록 설계됐다. 웨이모는 이미 제미나이의 ‘세계 지식’을 활용해 주행 상황을 학습하고 있다고 밝힌 바 있다. 이번 건에 대해서는 “탑승 경험을 개선하기 위한 다양한 기능을 실험하고 있지만, 실제 서비스로 이어질지는 미정”이라고 선을 그었다. 박찬 기자 cpark@aitimes.com",
  "published_at": "2025-12-25T17:47:47+09:00",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=205089",
  "source_id": "aitimes",
  "article_id": "3dc29b1061df",
  "cached_at": "2025-12-25T15:52:29.204968+00:00",
  "updated_at": "2025-12-25T15:52:29.204968+00:00"
}