{
  "title": "Authors sue six AI giants for book piracy",
  "description": "Pulitzer Prize winner John Carreyrou and other authors are suing OpenAI, Anthropic, Google, Meta, xAI, and Perplexity for book piracy. The AI companies allegedly stole their works from illegal online libraries. The lawsuit has a strong case, and this time the plaintiffs are going after the big bucks instead of the \"pennies\" of a class action settlement.",
  "image": "https://the-decoder.com/wp-content/uploads/2025/08/wireframe_book_illustration_2.png",
  "text": "Ask about this article… Search Another day, another lawsuit: Pulitzer Prize winner John Carreyrou and other authors accuse OpenAI, Anthropic, Google, Meta, xAI, and Perplexity of stealing their books from illegal piracy libraries. The lawsuit marks the first of its kind against xAI and Perplexity. Six of the largest AI companies are now facing a new copyright lawsuit. According to Bloomberg Law, several authors, including Pulitzer Prize-winning journalist John Carreyrou, filed suit in the US District Court for the Northern District of California on Monday. The lawsuit names Anthropic, Google, OpenAI, Meta, xAI, and Perplexity as defendants. The authors accuse the companies of a \"deliberate act of theft.\" This marks the first copyright lawsuit against xAI over its training practices and the first author lawsuit against Perplexity. Ad According to the complaint, the AI companies illegally downloaded copies of the books from so-called \"shadow libraries\" - piracy platforms like LibGen, Z-Library, and OceanofPDF. Ad DEC_D_Incontent-1 The lawsuit argues that the companies violated copyright law twice: first by illegally downloading the books, and again by creating additional copies during the training or \"optimization\" of their models. Their books \"now anchor multibillion-dollar product ecosystems\" without any compensation, they say. xAI dismisses claims as \"Legacy Media Lies\" According to Bloomberg Law, xAI simply replied with \"Legacy Media Lies.\" Perplexity's head of communications, Jesse Dwyer, said the company doesn't index books. According to the complaint, however, Perplexity reproduced and exploited the authors' copyrighted works without authorization in its RAG-based AI search system. Ad A similar case recently ended with Anthropic settling with authors for $1.5 billion based on legal reasoning that, even if fair use applies to AI training, it doesn't protect companies that used pirated copies. Carreyrou and several co-plaintiffs declined to join the Anthropic class action settlement, arguing that the proposed compensation—approximately $3,000 per work—amounted to little more than \"pennies on the dollar.\" By avoiding the class action route, the new lawsuit opens the door to much bigger payouts. If a jury finds willful infringement, the authors could receive up to $150,000 in damages per infringed work. Ad DEC_D_Incontent-2 \"LLM companies should not be able to so easily extinguish thousands upon thousands of high-value claims at bargain-basement rates, eliding what should be the true cost of their massive willful infringement,\" the complaint argues.",
  "published_at": "2025-12-24T12:48:40+00:00",
  "url": "https://the-decoder.com/authors-sue-six-ai-giants-for-book-piracy/",
  "source_id": "the_decoder",
  "article_id": "d05fda59174b",
  "cached_at": "2025-12-25T15:53:10.988792+00:00",
  "updated_at": "2025-12-25T15:53:10.988792+00:00"
}