{
  "title": "나델라 \"코파일럿 성능 불만\"...직접 제품 관리 나서 - AI타임스",
  "description": "사티아 나델라 마이크로소프트(MS) CEO가 AI 경쟁력 강화를 위해 사실상 최고 제품관리자(CPO) 역할까지 겸하며 현장에 깊숙이 개입하는 것으로 알려졌다. 구",
  "image": "https://cdn.aitimes.com/news/photo/202512/205018_206473_3855.jpg",
  "text": "(사진=셔터스톡) 사티아 나델라 마이크로소프트(MS) CEO가 AI 경쟁력 강화를 위해 사실상 최고 제품관리자(CPO) 역할까지 겸하며 현장에 깊숙이 개입하는 것으로 알려졌다. 구글과 오픈AI의 공세 속에서 '코파일럿(Copilot')의 기술적 완성도와 실제 활용도가 기대에 못 미친다는 위기감에 따른 것이다. 22일(현지시간) 디 인포메이션에 따르면, 나델라 CEO는 최근 소비자용 코파일럿을 개발하는 엔지니어들에게 보낸 이메일에서 구글의 '제미나이'가 구글 드라이브와 연동해 사진 요약 등 실질적인 기능을 강화한 점을 지적했다. 그는 MS의 관련 기능이 “대부분 제대로 작동하지 않고 똑똑하지도 않다”라고 강하게 비판한 것으로 알려졌다. 특히 지메일·아웃룩과 연동된 코파일럿의 성능에 대해 공개적으로 불만을 표했다. 나델라 CEO는 지난 9월 AI 제품 개발과 데이터센터 구축, 차세대 모델 연구에 집중하기 위해 일부 경영 업무를 내려놓겠다고 선언했다. 이후 영업 총괄인 주드슨 앨소프에게 ‘커머셜 CEO’ 직함을 부여하며 사업 부문을 위임했고, 자신은 기술과 제품에 전념하는 구조로 전환했다. 실제로 그는 수년간 직접 키노트를 맡아왔던 MS의 대표 행사 ‘이그나이트(Ignite)’에도 불참했다. 이후 100여명의 핵심 기술 인력이 참여하는 내부 팀즈 채널에서 AI 제품의 문제점을 직접 지적하고, 매주 1시간씩 회의를 주재하며 개발 상황을 점검한다는 사실은 이미 보도된 바 있다. 모델 사후 학습 방식 통합 등 구체적인 지시도 잇따르고 있다. AI 인재 확보에도 직접 나서 오픈AI, 구글 딥마인드 출신 인재들에게 전화를 걸고 파격적인 보상안을 승인하는 것으로 전해졌다. MS는 오픈AI와의 제휴를 바탕으로 기업용 AI 시장에서 빠르게 앞서 나갔지만, 나델라 CEO와 경영진은 핵심 수익원인 오피스 365에서 코파일럿이 업무를 실질적으로 자동화하지 못하고 있다는 점을 우려하고 있다. 실제로 UCLA 앤더슨 경영대학원은 365 코파일럿 50석을 도입했지만, 사용률이 낮아 내년에는 줄일 가능성을 검토 중이다. 이는 구독형 모델의 지속 가능성에도 부담이 된다. 무료 AI 도구들이 확산하며, 유료 코파일럿의 ‘가성비’에 대한 의문이 커지고 있기 때문이다. 미국 사우스다코타주 수폴스시는 직원들이 무료 챗GPT를 선호한다는 이유로 코파일럿 재계약을 하지 않을 가능성이 크다고 밝혔다. AI 코딩 도구의 대표 주자였던 깃허브 코파일럿도 경쟁 심화로 시장 선두를 위협받고 있다. 골드만삭스는 한때 약 1만석을 도입했지만, 최근에는 코그니션의 '데빈(Devin)' 등 다른 도구로 상당 부분 전환한 것으로 알려졌다. 전 MS 제품 관리자였던 타누자 코를레프는 “깃허브는 2024년 초까지는 훌륭했지만, 2025년에는 커서에 밀렸다”라고 평했다. 이에 대해 나델라 CEO는 깃허브 코파일럿을 다양한 AI 에이전트를 묶어 제공하는 ‘플랫폼형 구독 서비스’로 진화시키겠다는 구상을 내놓았다. 이를 “여러 AI 에이전트를 담은 케이블 TV 같은 존재”라고 표현했다. 내부적으로는 비판을 이어가고 있지만, 그는 코파일럿의 가장 적극적인 전도사다. 올해만 X(트위터)에 코파일럿 관련 글을 80회 이상 올리며, 제품 홍보와 활용 사례를 직접 소개하고 있다. 장기적으로는 기업 내에서 코파일럿을 ‘디지털 직원’ 수준으로 끌어올려 행정·사무 업무를 대체하는 것이 목표다. 단기적으로는 개발 속도가 최대 과제다. 엑셀에서 복잡한 재무 모델을 생성하는 기능이 늦어지는 데 대해 강한 불만을 표했고, 일부 기능은 오픈AI 대신 앤트로픽의 모델을 활용해 보완됐지만 출시가 계획보다 지연된 것으로 전해졌다. 내부적으로 “지금은 기업의 성패가 갈리는 변곡점”이라며 과거 인터넷·모바일 전환기에 MS가 겪었던 전략적 실패를 자주 상기시키고 있다. 막대한 현금 창출 능력을 가진 MS는 여전히 유리한 위치에 있지만, 코파일럿이 사용성과 가치를 증명하지 못한다면 우위를 장담할 수 없다는 평이다. 박찬 기자 cpark@aitimes.com",
  "published_at": "2025-12-23T18:00:00+09:00",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=205018",
  "source_id": "aitimes",
  "article_id": "14cd8fe2a327",
  "cached_at": "2025-12-23T11:30:15.270520+00:00"
}