{
  "title": "[신년사] 잡코리아 “창립 30주년 맞아 AI 에이전트 출시에 역량 집중” - AI타임스",
  "description": "2026년 창립 30주년을 맞는 채용 전문 잡코리아가 새로운 AI 에이전트 출시를 위해 전사 역량을 집중하고 있다고 전했다.잡코리아(대표 윤현준)는 23일 신년사",
  "image": "https://cdn.aitimes.com/news/photo/202512/205009_206462_5418.jpeg",
  "text": "윤현준 잡코리아 대표 (사진=잡코리아) 2026년 창립 30주년을 맞는 채용 전문 잡코리아가 새로운 AI 에이전트 출시를 위해 전사 역량을 집중하고 있다고 전했다. 잡코리아(대표 윤현준)는 23일 신년사를 통해 HR 업계 선도적인 AI 기술력으로 기업과 구직자 간 일자리 연결 매칭률을 강화하겠다고 밝혔다. 윤현준 잡코리아 대표는 “최근의 채용 시장은 양적 확장보다 질적 효율과 정교한 매칭으로 중심축이 이동하고 있다”라며 “경기 불확실성 및 산업별 편차가 커지면서, 기업은 대규모 공채를 줄이고, 필요 인재를 빠르게 확보하는 수시 채용과 직무 중심 채용을 강화하고 있다”라고 말했다. 구직자는 단순히 공고를 많이 보는 것보다 ‘나에게 맞는 조건과 성장 기회’를 더 빠르게 찾고 비교하는 것이 중요하다고 밝혔다. 기존처럼 플랫폼이 단순히 일자리를 나열하는 방식만으로는 부족하다는 설명이다. 실제, 잡코리아는 이용자의 탐색 비용을 줄이기 위해 데이터 중심 추천 및 매칭 고도화 등 채용 운영 전반 효율화에 집중하고 있다. 특히, 생성 AI를 적극 활용 중이다. HR은 생성 AI의 영향을 가장 많이 받는 분야 중 하나라고 전했다. 공고 작성, 이력서 분석, 추천, 스크리닝 등 반복 업무를 AI로 자동화하는 것을 넘어 ‘AI 에이전트’로 나아가고 있다고 설명했다. 잡코리아의 29년 업력이 경쟁력 자체이라고 강조했다. 긴 시간 축적한 데이터와 AI 기술 역량을 바탕으로, 새로운 혁신의 30년을 준비하고 있다는 것이다. 이제는 AI가 채용 전 과정을 지원하는 ‘풀 사이클 자동화 체계’를 본격 확장해 ‘AI 커리어 에이전트 시대’를 이끄는 대표 플랫폼으로 거듭난다는 계획이다. 창립 30주년을 맞이해 ‘리:스타트업’을 슬로건으로 새로운 도약을 준비 중이다. IT 업계 최고 수준 AI 기술력을 바탕으로, 생각 및 추론 중심 AI 에이전트 출시를 위해 전사 역량을 집중하고 있다고 전했다. 새로운 잡코리아 AI 에이전트는 단순 공고 포스팅 방식을 넘어 기업과 구직자의 채용 의사결정을 지원한다. 자연어로 모든 커리어 인사이트 탐색이 가능하도록 시스템을 갖출 계획이다. 이를 통해 AI가 정량적 판단과 분석을 담당하고, 사람은 전략적 의사결정에 집중할 수 있는 구조를 정착시켜 개인과 기업 커리어 전략을 같이 설계하는 역할로 거듭난다는 목표다. 국내외 빅테크 기업과 전략적 파트너십을 강화해 공고 채널 다각화에도 박차를 가할 계획이다. 이미 생활밀착형 금융 앱 토스, 대표 직장인 커뮤니티 블라인드 등과 제휴해 잡코리아와 알바몬의 공고를 노출시킨 만큼, 앞으로도 협력을 지속할 예정이다. (사진=잡코리아) 한편, 잡코리아는 정규직 채용 전문 플랫폼 ‘잡코리아’와 비정규직 채용 플랫폼 ‘알바몬’ 그리고 채용 관리 솔루션(ATS) ‘나인하이어’ 및 외국인 구인구직 서비스 ‘클릭(KLiK)’까지 커리어 라이프사이클 전 구간을 아우르는 ‘토털 커리어 플랫폼’을 운영하고 있다. 지난 2024년에는 업계 최초로 개발한 생성 AI 솔루션 ‘룹(LOOP Ai)’을 선보였다. 룹은 29년간 축적한 한국어 채용 데이터를 학습한 대형언어모델(LLM)과 HR 데이터를 활용해 공고 추천, 공고 및 이력서 요약, 합격 가능성 예측 등을 제공한다. 최근에는 룹에 AI 추천 2.0 서비스를 도입하기도 했다. 도입 후 1개월 간 입사 지원 수는 104%, 공고 조회수와 이용자 수도 각각 43%, 11% 상승한 것으로 나타났다. 지원 전환율도 50%를 넘어섰다. 추천 정확도는 높이고, 구인자들이 검색에 할애하는 시간은 단축됐다는 증거라고 강조했다. 이 외에도 공고 작성부터 추천, 지원 및 합격으로 이어지는 전 과정에 AI 자동화 서비스를 도입했다. 최근에는 커리어 플랫폼 잡플래닛을 인수하며 AI 기술에 커뮤니티 데이터까지 결합, 신사업 추진을 가속하는 중이다. 현재 준비 중인 AI 커리어 에이전트 고도화에 큰 도움이 될 것으로 전망했다. 윤현준 잡코리아 대표는 “AI와 디지털 전환 흐름은 더욱 가속화될 예정이며, AI 기술을 활용해 기업-구직자 간 일자리 연결을 가장 우선적으로 생각하는 서비스를 지속적으로 선보일 것”이라며 “AI 에이전트 상용화와 서비스 고도화를 통해 정규직, 비정규직 전 영역을 아우르는 종합 HR테크 파트너로 도약하겠다”라고 말했다. 장세민 기자 semim99@aitimes.com",
  "published_at": "2025-12-23T12:54:10+09:00",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=205009",
  "source_id": "aitimes",
  "status": "RAW",
  "article_id": "a03cb5714e75",
  "cached_at": "2025-12-23T05:23:25.262854+00:00"
}