{
  "title": "Big AI’s biggest names rally around the Agentic AI Foundation to set agent standards",
  "summary": "The Linux Foundation has launched the Agentic AI Foundation. Anthropic, OpenAI, and Block are contributing three open-source projects, and nearly every major tech company has signed on as a member.",
  "image": "https://the-decoder.com/wp-content/uploads/2025/12/Linux_Foundation_Announces_Formation_of_the_Agentic_AI_Foundation.jpg",
  "text": "Matthias is the co-founder and publisher of THE DECODER, exploring how AI is fundamentally changing the relationship between humans and computers. Content Summary The Linux Foundation has launched the Agentic AI Foundation. Anthropic, OpenAI, and Block are contributing three open-source projects, and nearly every major tech company has signed on as a member. Ad The Linux Foundation has introduced the Agentic AI Foundation (AAIF), a neutral home for building agentic AI. Direct competitors like OpenAI, Anthropic, Google, and Microsoft are now working together on open standards for AI agents, according to the announcement. Anthropic's MCP emerges as the core standard The foundation is built around three open source projects: Anthropic's Model Context Protocol (MCP), Block's goose, and OpenAI's AGENTS.md. Together, they aim to standardize how AI agents interact with external tools and operate across different systems. \"We are seeing AI enter a new phase, as conversational systems shift to autonomous agents that can work together. Within just one year, MCP, AGENTS.md and goose have become essential tools for developers building this new class of agentic technologies,\" says Linux Foundation Executive Director Jim Zemlin in the press release. Ad Ad THE DECODER Newsletter The most important AI news straight to your inbox. ✓ Weekly ✓ Free ✓ Cancel at any time Please leave this field empty Anthropic's Model Context Protocol launched in November 2024 and quickly established itself as the standard way to link AI models with external tools, data, and applications. More than 10,000 MCP servers have already been published, according to the Linux Foundation. The protocol is supported by Claude, Cursor, Microsoft Copilot, Gemini, VS Code, and ChatGPT. Block and OpenAI add key components Block, the company behind Square and Cash App, is contributing goose - an open-source framework for AI agents. Released in early 2025, it combines language models with extensible tools and MCP-based integration, giving developers a structured path for building agent workflows. OpenAI is contributing AGENTS.md, a standard introduced in August 2025 that gives AI coding agents project-specific instructions. The Markdown-based format has already been adopted by more than 60,000 open-source projects and is supported by frameworks like Cursor, Devin, GitHub Copilot, and Gemini CLI. OpenAI was also an early supporter of MCP. The AAIF membership list includes nearly every major tech company: Amazon Web Services, Anthropic, Block, Bloomberg, Cloudflare, Google, Microsoft, OpenAI, Cisco, IBM, Oracle, Salesforce, SAP, Snowflake, Hugging Face, and Uber. Why shared standards matter for AI agents As AI agents grow more capable, shared standards are becoming critical. Without them, the agentic web could splinter into isolated systems that barely communicate - much like the early internet before open protocols tied everything together. The Agentic AI Foundation wants to avoid that outcome. By gathering protocols like MCP, frameworks like goose, and conventions like AGENTS.md under one neutral umbrella, the group aims to keep agent frameworks, cloud providers, and developer tools compatible. The goal seems simple: the next generation of AI agents should run on open, interoperable protocols managed independently of any single company. Ad",
  "published_at": 