{
  "title": "Quilter&apos;s AI just designed an 843‑part Linux computer that booted on the first try. Hardware will never be the same.",
  "summary": "Quilter&apos;s AI designed a working 843-component Linux computer in 38 hours—a task that typically takes engineers 11 weeks. Here&apos;s how they did it.",
  "published_at": "2025-12-10T06:00-08:00",
  "modified_at": "2025-12-11T03:35:10.020Z",
  "author": "Michael Nuñez",
  "image": "https://images.ctfassets.net/jdtwqhzvc2n1/3ibU0O0ON6nC4NSVY5KYkP/e13a276f2bece890100148b10cbcf165/nuneybits_Vector_art_of_self-building_computer_isometric_ca3b7721-5759-4033-9885-e096e5d68ddc.webp?w=800&amp;q=75",
  "text": "A Los Angeles-based startup has demonstrated what it calls a breakthrough in hardware development: an artificial intelligence system that designed a fully functional Linux computer in one week — a process that would typically consume nearly three months of skilled engineering labor. Quilter, which has raised more than $40 million from investors including Benchmark, Index Ventures, and Coatue, used its physics-driven AI to automate the design of a two-board computer system that booted successfully on its first attempt, requiring no costly revisions. The project, internally dubbed \"Project Speedrun,\" required just 38.5 hours of human labor compared to the 428 hours that professional PCB designers quoted for the same task. The announcement also marks the first public disclosure that Tony Fadell, the engineer who led development of the iPod and iPhone at Apple and later founded Nest, has invested in the company and serves as an advisor. \"We didn't teach Quilter to draw; we taught it to think in physics,\" said Sergiy Nesterenko, Quilter's chief executive and a former SpaceX engineer, in an exclusive interview with VentureBeat. \"The result wasn't a simulation — it was a working computer.\" Circuit board design remains the forgotten bottleneck that delays nearly every hardware product The announcement shines a light on an unglamorous but critical chokepoint in technology development: printed circuit board layout. While semiconductors and software have received enormous attention and investment, the green fiberglass boards that connect chips, memory, and components in virtually every electronic device remain stubbornly manual to design. \"Besides auto-routers, the technology really hadn't changed since the early '90s,\" Fadell told VentureBeat. \"The best boards are still made by hand. You go to Apple, they've got the tools, and these guys are just pushing traces, checking everything, doing flood fills—and you're like, there's got to be a better way.\" The PCB design process typically unfolds in three stages. Engineers first create a schematic — a logical diagram showing how components connect. Then a specialist manually draws the physical layout in CAD software, placing components and routing thousands of copper traces across multiple layers. Finally, the design goes to a manufacturer for fabrication. That middle step — the layout — creates a persistent bottleneck. For a board of moderate complexity, the process typically consumes four to eight weeks. For sophisticated systems like computers or automotive electronics, timelines stretch to three months or longer. \"The timeline was always this elastic thing—they'd say, 'Yeah, that's two weeks minimum,'\" Fadell recalled of his experience at Apple and Nest. \"And we'd say, 'No, no. Work day and night. It's two weeks.' But it was always this fixed bottleneck.\" The consequences ripple through hardware organizations. Firmware teams sit idle waiting for physical boards to test their code. Validation engineers cannot begin debugging. Product launches slip. According to Quilter's research, only about 10 percent of first board revisions work correctly, forcing expensive and time-consuming respins. Project Speedrun put Quilter's AI to the test with an 843-component computer that booted on the first try Project Speedrun was designed to push the technology to its limits while producing an easily understood result: a working computer that could boot Linux, browse the internet, and run applications. The system consists of two boards based on NXP's i.MX 8M Mini reference platform, a processor architecture used in automotive infotainment, industrial automation, and machine vision applications. The main system-on-module contains a quad-core ARM processor running at 1.8 gigahertz, 2 gigabytes of LPDDR4 memory, and 32 gigabytes of eMMC storage. A companion baseboard provides connectivity including Ethernet, USB, HDMI, and audio. Together, the boards incorporate 843 components and 5,141 electrical connections, or \"pins,\" routed across eight-layer circuit board stackups manufactured by Sierra Circuits in California. The minimum trace geometry reached 2 mils (two-thousandths of an inch) on the system-on-module — fine enough to require advanced high-density interconnect manufacturing techniques. Quilter's AI completed the layout with approximately 98 percent routing coverage and zero design rule violations. Both boards passed power-on testing and successfully booted Debian Linux on the first attempt. \"We made an entire computer to demonstrate that this technology works,\" Nesterenko said. \"We took something that's typically quoted at 400 to 450 hours, automated the vast majority of it, and reduced it to about 30 to 40 hours of cleanup time.\" The cleanup time is work that human engineers still perform: reviewing the AI's output, fixing any issues, and preparing final fabrication files. But even with that overhead, the total elapsed time from schematic to fabricated boards collapsed from the typical 11 weeks to a single week. Unlike ChatGPT, Quilter's AI learns by playing billions of games against the laws of physics Quilter's technical approach differs fundamentally from the large language models that have dominated recent AI headlines. Where systems like GPT-5 or Claude learn to predict text based on massive training datasets of human writing, Quilter's AI learns by playing what amounts to an elaborate game against the laws of physics. \"Language models don't apply to us because this is not a language problem,\" Nesterenko explained. \"If you ask it to actually create a blueprint, it has no training data for that. It has no context for that.\" The company also rejected the seemingly obvious approach of training on examples of human-designed boards. Nesterenko cited three reasons: humans make frequent errors (explaining why most boards require revisions), the best designs are locked inside large companies unwilling to share proprietary data, and training on human examples would cap the AI's performance at human levels. Instead, Quilter built what Nesterenko describes as a \"game\" where the AI agent makes sequential decisions — place this component here, route this trace there — and receives feedback based on whether the resulting design satisfies electromagnetic, thermal, and manufacturing constraints. \"What you're really changing is not the probability of getting a very specific outcome of the model, but the probability of choosing a certain action based on that experience,\" Nesterenko said. The approach mirrors DeepMind's progression with its Go-playing systems. The original AlphaGo learned from human games, but its successor AlphaZero learned purely through self-play and ultimately surpassed human capability. Quilter harbors similar ambitions. \"In the long term, to come up with better designs for circuit boards than humans have ever tried to do,\" Nesterenko said. Fadell drew a parallel to an earlier technological transition: \"I remember this with assembly. You had assembly and compilers, and engineers would say, 'I can't trust the compiler. I'm going to do the loop unrolling myself.' Now very, very few people write any assembly.\" He expects PCB design to follow a similar arc: \"I hope the same thing happens with PCB design. Sure, a few people will hold out, but these tools are going to get so good that everyone else will move on.\" Fadell and Nesterenko spent months solving a delicate problem: how to automate design without stripping engineers of control Automating a task that skilled professionals have performed manually for decades raises an obvious question: how do engineers maintain control over designs that will ultimately ship in products where reliability matters? Fadell said he spent significant time with Nesterenko working through this tension. The solution, he said, lies in allowing users to choose their level of involvement at each stage of the process. \"If you're a control freak, you can be a control freak. If you want to say 'just do it for me,' you can do that too—and everything in between,\" Fadell said. \"You can walk through each phase of the design and get involved wherever you want, or let the AI handle it.\" The workflow breaks into three phases: setup, where engineers define constraints and requirements; execution, where the AI generates candidate layouts; and cleanup, where humans review and refine the output. Engineers can intervene at any point, adjusting constraints and regenerating designs until they're satisfied. \"This is something Tony and I talk about a lot,\" Nesterenko said. \"How do we give users control while still automating most of the work?\" Quilter's technology has clear boundaries: 10,000 pins and 10 gigahertz mark the current limits The technology has clear limitations. Quilter currently handles boards with up to roughly 10,000 pins — sufficient for a wide range of applications but well short of the most complex designs, which can exceed 100,000 connections. Physics complexity also creates boundaries. The system handles high-speed communications up to approximately 10 gigahertz, covering typical consumer electronics and many industrial applications. But advanced systems like sophisticated radar, which can operate at 100 gigahertz, exceed current capabilities. \"There are boards where Quilter won't make enough progress to make the cleanup time worthwhile,\" Nesterenko acknowledged. \"We're just not that helpful yet with the most advanced, sophisticated designs.\" The company has focused initially on categories where speed matters more than extreme complexity: test fixtures, evaluation boards, design validation boards, and environmental test hardware. These boards often sit in long queues behind higher-priority production designs, delaying engineering programs. The company bets that engineers will pay the same price for a 10x speed improvement Quilter prices its service by pin count, matching the billing conventions that already exist when companies hire outside layout specialists. The pitch to customers is cost neutrality with a ten-fold improvement in speed. \"We're going to charge you roughly the same that you would pay for the pins that you would with a person,\" Nesterenko said. \"But the reason you choose us is that we do this 10 times faster.\" For a company waiting three months for a board layout, receiving it in a week fundamentally changes what's possible. Engineering teams can run multiple design experiments in parallel. Firmware developers get hardware faster. Products reach the market sooner. The company offers free access for hobbyists, students, and small businesses with less than $50,000 in revenue — a strategy to build familiarity while targeting enterprise customers for commercial revenue. The iPod creator waited years to attach his name to Quilter — until he could prove the technology actually works Fadell said he chose this moment to publicly acknowledge his investment because the Project Speedrun demonstration provides concrete evidence that the technology works. \"It's not about being comfortable—I was always comfortable with the team,\" he said. \"This was about waiting until we had something you could hang your hat on. Now I can say, 'I've used the tool. I've seen it.'\" He contrasted his approach with typical investor announcements: \"Every investor goes, I invested in this, it's gonna change the world. It's like, no, I know better. I've used the tool. I know people who use it. I asked my startups to use the tool.\" Fadell's involvement goes beyond capital. He described email exchanges running to \"a dozen pages of details\" covering product design, user experience, enterprise sales, and technical architecture. \"Of all the investors I work with, Tony by far goes deepest with me on the product side,\" Nesterenko said. If Quilter succeeds, it could unlock a new generation of hardware startups that were never economically viable before The stakes extend far beyond one company's product roadmap. If Quilter's technology scales, it could fundamentally alter the economics of building physical products. Fadell argued that hardware development has historically moved slowly because each step in the process — schematic design, PCB layout, manufacturing, assembly — created friction. Other innovations have already smoothed schematic tools and manufacturing. Layout remained the stubborn holdout. \"Once you shrink that from weeks to hours, you can iterate so much faster because all the other friction in the chain has been reduced,\" Fadell said. He predicted the technology would eventually extend upstream into schematic design itself, with AI that understands both logical connections and physical constraints helping engineers avoid problems earlier in the process. At MIT, where Fadell now spends time, he encounters would-be founders who have abandoned hardware ambitions because the process seemed insurmountable. \"I talk to professors and startup founders, and they say, 'I'm never doing hardware. It's too hard,'\" he said. \"I hope we can make it easier for more people to jump in and try things.\" Industry veterans remain skeptical. Auto-routing tools — previous attempts at automation — became notorious for producing unusable results, spawning T-shirts proclaiming engineers would \"never trust the auto-router.\" Nesterenko has seen the skepticism dissolve in real time. He described a recent meeting with executives from a major customer who came to discuss Quilter's capabilities. As the conversation unfolded, one executive picked up the Project Speedrun boards and began photographing them from every angle, turning them over in his hands. \"He was just fascinated by the fact that this is possible now,\" Nesterenko said. The question is no longer whether AI can design circuit boards. A working Linux computer, assembled from 843 components and booted on the first attempt, answers that definitively. The question now is what engineers will build when layout stops being the bottleneck — when hardware, as Fadell put it, finally \"moves at the speed of thought.\" On that point, Nesterenko offered a prediction. \"If you ask the average electrical engineer today whether automation or AI could at all help with the board of this complexity, they would say no,\" he said. For decades, they would have been right. As of last week, they're not.",
  "url": "https://venturebeat.com/ai/quilters-ai-just-designed-an-843-part-linux-computer-that-booted-on-the"
}