{
  "title": "Trump approves Nvidia H200 sales, but China may not bite",
  "summary": "The US government under Donald Trump is planning to approve the export of Nvidia's H200 AI accelerators to China under certain conditions. In return, the US is demanding a 25% tax, while the most powerful models will remain blocked.",
  "image": "https://the-decoder.com/wp-content/uploads/2023/11/H200-Graphic.jpg",
  "text": "Max is the managing editor of THE DECODER, bringing his background in philosophy to explore questions of consciousness and whether machines truly think or just pretend to. Content Summary The US government under Donald Trump plans to authorize the export of Nvidia's H200 AI accelerators to China, subject to conditions. In exchange, the US demands a 25 percent levy, while the most powerful models remain banned. Ad President Donald Trump announced plans to approve the export of Nvidia's H200 processors to China. As Reuters reports, citing a post on Truth Social, the authorization is tied to a 25 percent fee payable to the US government. Trump stated he informed Chinese President Xi Jinping of the move, who reportedly reacted positively. The US Department of Commerce is currently working out the details of the agreement. According to Trump, the new rule will also apply to other US chipmakers like AMD and Intel. The 25 percent fee is significantly higher than the 15 percent discussed in August. A government official explained the mechanism to Reuters: The levy will be collected as an import tax when chips are imported into the US from their manufacturing site in Taiwan. There, they undergo a security review by US officials before being forwarded to approved customers in China. Ad Ad THE DECODER Newsletter The most important AI news straight to your inbox. ✓ Weekly ✓ Free ✓ Cancel at any time Please leave this field empty Top-tier models remain off-limits The easing of export restrictions applies specifically to the H200 chip, Nvidia's second-most powerful AI accelerator. The cutting-edge \"Blackwell\" generation and the upcoming \"Rubin\" architecture are explicitly excluded from this agreement, according to Trump. According to a report by the Institute for Progress, the H200 is nearly six times more powerful than the H20, previously the strongest chip legally exportable to China. However, a performance gap remains: Blackwell chips are roughly 1.5 times faster at AI training and up to five times faster at inference than the H200. Government officials view the decision as a compromise. The goal is to prevent a total embargo from accelerating China's own efforts to develop competitive AI chips through companies like Huawei. In a statement, Nvidia called the move a thoughtful balance that benefits America. It remains unclear how Chinese authorities will respond, though a Financial Times report suggests Beijing may restrict access to Nvidia's advanced H200 chips. According to the report, Chinese regulators are discussing ways to limit authorized access to these AI chips. Beijing had previously warned domestic companies against using US technology. At the same time, numerous local infrastructure projects continue to plan with Nvidia chips. Ad",
  "published_at": 