{
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204740",
  "source_id": "aitimes",
  "title": "김일두 오픈리서치 대표 ”투자금 도박 유용...사업으로 피해 복구할 것”",
  "text": "김일두 오픈리서치 대표 (사진=오픈리서치) 100억원 규모의 시드 투자 유치로 주목받았던 김일두 오픈리서치 대표가 개인 소셜미디어를 통해 도박 자금 유용 사실을 털어 놓은 것으로 알려졌다. 12일 업계에 따르면, 김일두 대표는 개인 채무자에게 보내는 사과문을 통해 개인 도박 문제로 회사 지분을 일부 매각하고 사채를 빌리는 등 금전적 문제를 일으킨 사실을 인정했다. 카카오브레인 출신의 김일두 오픈리서치 대표는 올해 3월 검색 플랫폼 ‘오오에이아이(oo.ai)를 정식 출시, 9주 만에 월간 활성 이용자(MAU) 200만명을 돌파하며 업계의 주목을 받았다. 특히, 설립 두달 만에 100억원 규모의 시드 투자를 유치하는 등 ‘가장 빠른 성장세를 보이는’ 국내 스타트업으로 자리 잡은 바 있다. 하지만, 최근 오오에이아이의 서비스가 갑작스럽게 중단되는 동시에 회사 투자금 일부를 도박 등 개인 목적으로 사용했다는 의문이 제기되기 시작했다. 업계에서는 직원들의 월급 지급이 중단되며, 회사를 이탈한다는 확인되지 않은 소문이 퍼지기도 했다. 이에 대해 김 대표는 이달 초 일부 매체와의 인터뷰를 통해 “투자금 집행에 대해 사전 승인을 받지 않아서 투자처와 분쟁이 있던 것은 사실”이라며 “하지만, 이는 계약 사항을 제대로 숙지하지 못해 발생한 부분이며 도박설은 사실무근이다”라고 입장을 밝혔다. 그러나 일주일이 지난 시점, 논란이 사실이었다고 인정한 것이다. 그는 사과문을 통해 “2024년 4월 라스베이거스 출장 중 처음 카지노를 접했다”라며 “이후 오랜 기간 접근하지 않았으나 올해 다시 도박을 시작했다”라고 밝혔다. 이어 “장기간 우울 및 공황장애를 앓고 있던 차에 카지노는 고통을 잊게 했다”라며 “직접 도박을 했다기 보다는 AI를 이용해 자동 배팅 프로그램을 개발해서 예측하고, 자금을 관리하도록 했기 땜문에 현실적 감각과 도덕적 기준을 심각하게 상실하게 됐다”라고 말했다. 개인적 치료를 병행하며, 금전적 피해를 수습하겠다고 강조했다. “AI 관련 용역을 포함해 회사 제품의 성공적인 사업 확장으로 피해 회복을 위한 돈을 마련하겠다”라며 “대여 및 투자를 해주신 것에 대해 반드시 끝까지 피해 없도록 하겠다”라고 말했다. 한편, 현재 오픈리서치 공식 홈페이지에는 “새로운 oo.ai가 곧 찾아옵니다”라고 표시돼 있다. 2026년 1월11일 새로운 버전의 오오에이아이 출시를 앞두고 사용자 대기 명단을 받고 있는 상태다. 현재 5000여명이 대기 중이다. 장세민 기자 semim99@aitimes.com",
  "image": "https://cdn.aitimes.com/news/photo/202512/204740_206077_5517.jpeg",
  "summary": "100억원 규모의 시드 투자 유치로 주목받았던 김일두 오픈리서치 대표가 개인 소셜미디어를 통해 도박 자금 유용 사실을 털어 놓은 것으로 알려졌다. 12일 업계에 따르면, 김일두 대표는 개인 채무자에게 보내는 사과문을 통해 개인 도박 문제로 회사 지분을 일부 매각하고 사채를 빌리는 등 금전적 문제를 일으킨 사실을 인정했다. 카카오브레인 출신의 김일두 오픈리서치 대표는 올해 3월 검색 플랫폼 ‘오오에이아이(oo.ai)를 정식 출시, 9주 만에 월간 활성 이용자(MAU) 200만명을 돌파하며 업계의 주목을 받았다. 특히, 설립 두달 만에",
  "published_at": "2025-12-12T12:31:02+09:00",
  "article_id": "9ae4f0",
  "cached_at": "2025-12-12T05:12:57.084802+00:00",
  "mll_status": "error: HTTPConnectionPool(host='localhost', port=8000): R",
  "version": "V1.0"
}