{
  "title": "[11월28일] 엔비디아와 유명 투자가의 설전...AI 버블을 둘러싼 하이라이트",
  "summary": "최근 월가의 가장 뜨거운 이슈 중 하나는 세계에서 가장 가치 있는 기업 엔비디아와 한 유명 투자자와의 공방전입니다. 주인공은 영화 '빅쇼트'로 잘 알려진 마이클 버리입니다.그는 2008년 미국의 서브 프라임 모기지 사태를 예측, 대규모 공매도(숏 포지션)를 통해 막대한 부를 축적하며 유명세를 얻었습니다. 이는 마이클 루이스의 책에 이어, 크리스찬 베일이 주역을 맡은 영화로도 제작됐습니다. 그의 X(트위터) 팔로워는 160만명에 달합니다.늘 성공을 거둔 것만은 아닙니다. 특히, 2020년에는 테슬라 주가 하락을 예상하고 숏 포지션을",
  "published_at": "2025-11-29T07:00:00+09:00",
  "modified_at": "2025-11-29T07:00:00+09:00",
  "author": [
    "AI타임스"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202511/204329_205514_1229.png",
  "text": "(사진=셔터스톡) 최근 월가의 가장 뜨거운 이슈 중 하나는 세계에서 가장 가치 있는 기업 엔비디아와 한 유명 투자자와의 공방전입니다. 주인공은 영화 '빅쇼트'로 잘 알려진 마이클 버리입니다. 그는 2008년 미국의 서브 프라임 모기지 사태를 예측, 대규모 공매도(숏 포지션)를 통해 막대한 부를 축적하며 유명세를 얻었습니다. 이는 마이클 루이스의 책에 이어, 크리스찬 베일이 주역을 맡은 영화로도 제작됐습니다. 그의 X(트위터) 팔로워는 160만명에 달합니다. 늘 성공을 거둔 것만은 아닙니다. 특히, 2020년에는 테슬라 주가 하락을 예상하고 숏 포지션을 취했으나, 테슬라 주가가 2배가량 뛰며 큰 손해를 봤습니다. 그러던 중, 최근에는 인공지능(AI)에 초점을 맞추기 시작했습니다. 이달 초에는 현재의 AI 붐이 과거 닷컴 버블이나 2008년 주택 시장 붕괴 직전과 유사한 과열 상태라고 경고하며, AI 수혜를 가장 많이 본 팔란티어의 주가가 지나치게 부풀려져 있다고 지적했습니다. 이후 팔란티어 주가는 고점 대비 25%까지 하락했습니다. 알렉스 카프 팔란티어 CEO는 버리가 '미친 짓(batshit crazy)'을 했다며 원색적인 비난을 퍼부었습니다. 그리고 버리는 지난 24일 블로그와 소셜 미디어 등을 통해 AI 투자 붐이 과거의 닷컴 버블을 재현하고 있으며, 엔비디아가 그 중심에 있다고 주장했습니다. 닷컴 버블로 막대한 타격을 입은 시스코와도 비교했습니다. 특히, 엔비디아 GPU의 유효성, 즉 감가상각이 2~3년에 불과해 기업들이 GPU 구매 비용을 감당하기 어렵고, 실제 수요는 터무니없이 적다고 지적했습니다. 순환 거래를 통해 수요를 부풀리고 있다고도 주장했습니다. 이 밖에도 엔비디아가 2018년 이후 1130억달러 상당의 자사주를 매입했지만, 실제 유통 주식 수는 오히려 증가해 주주 수익을 50% 감소시켰다고 주장했습니다. 그러자 엔비디아는 다음날 월가의 일부 애널리스트들에게 버리의 주장을 조목조목 반박하는 내용의 메일을 돌린 것으로 알려졌습니다. 여기에서는 2020년에 출시된 'A100'과 같은 구형 GPU가 여전히 높은 활용률을 유지하는 등 GPU의 실제 가치는 버리의 주장보다 훨씬 길다는 내용이 포함됐습니다. 또 버리가 지적한 자사주 매입을 반박하는 자료를 자세하게 제시하며, 엔론과 같은 과거 회계 부정과 비교해서는 안 된다고 강조했습니다. 또 엔비디아의 전략적 투자는 매출의 작은 부분을 차지하기 때문에 순환 거래에 의존하는 것이 아니라고 밝혔습니다. 이어 버리는 \"나는 엔비디아를 엔론과 비교한 것이 아니다. 1990년대 후반 시스코와 비교한 것\"이라고 밝혔습니다. 엔론은 회계 조작으로 무너진 대표적인 회사입니다. 반면, 인터넷 붐으로 한때 세계 최고의 기업 가치를 기록한 시스코는 과도한 인터넷 인프라 투자로 인해 2년여 만에 주가 75%를 날렸습니다. 이런 사실이 연일 폭로전 양상으로 펼쳐지며, 사람들의 관심을 끌기 시작한 것입니다. 영화 '빅쇼트'의 배우 크리스찬 베일(왼쪽)과 실제 인물 마이클 버리 (사진=X, Cassandra Unchained) 현재 미국은 추수 감사절 연휴를 맞아 한숨 돌리는 분위기지만, 이 문제는 다음 주 장이 열리면 다시 불붙을 첨예한 사안으로 꼽히고 있습니다. 엔비디아와 버리의 대결을 넘어, AI 거품론에 영향을 미칠 수 있다는 분석입니다. 특히 버리는 이번 싸움에서 져도 잃을 것이 별로 없지만, 엔비디아는 그렇지 않습니다. 가만히 비난을 받아들일 리 없습니다. 이 때문에 엔비디아는 지난 19일 실적 발표에서도 이전 분기 최대 실적을 달성한 것은 물론, 이번 분기에도 시장 예상을 넘는 강력한 매출을 예고했습니다. 당시에는 AI 버블 논란을 잠재웠다는 평을 받았습니다. 버리의 주장이 사실이든 아니든, AI 과잉 투자 주장을 믿는 투자자가 많아지면 문제가 일어나게 됩니다. 물론 대부분 전문가가 지적하듯, 거품론과는 관계없이 AI 기술은 계속 사회 전 부분으로 확대될 것입니다. 또 상당수 전문가는 현재 AI 붐이 과거의 인터넷 시절과는 다르다고 지적합니다. 미국 연방준비제도이사회(Fed) 제롬 파월 의장은 지난달 기자회견을 통해 AI는 매우 높은 가치로 평가되는 기업들이 실제로 수익을 낸다는 점에서 다르다며, \"AI 인프라에 대한 기술 부문 지출에 영향을 미치지 않을 가능성이 높다\"라고 말한 것이 대표적입니다. 이어 27일 주요 뉴스입니다. 순다르 피차이 CEO (사진=구글) ■ 구글 CEO \"고생한 직원들 휴식 취할 시간...차기 모델도 바로 착수\" 피차이 CEO가 자체 팟캐스트를 통해 제미나이 3를 개발하기까지 지난 몇년 동안 구글이 많은 준비를 했다고 밝혔습니다. 이는 구글이 이제는 1등으로 올라섰다는 것을 강조하는 것입니다. 직원들에게도 휴식이 필요하다며, 만족감을 나타냈습니다. ■ 중국 오픈 소스 모델, 사상 처음으로 미국 인기 넘어서 딥시크로 시작해 알리바바로 이어진 중국의 오픈 소스 모델 출시가 결국 이 분야 최고였던 미국을 밀어냈습니다. 허깅페이스에서 중국 모델이 최근 1년간 가장 많이 다운로드된 것입니다. 이는 메타의 '라마 4'가 부진한 탓도 큽니다. ■ 오픈AI \"청소년 자살에 책임 없어...'챗GPT'가 100번 이상 경고\" 챗GPT가 자살을 문의하는 청소년에게 100번 이상 전문가와 상담하라는 경고를 한 것으로 알려졌습니다. 동시에 챗봇은 자살을 부추기기도 했다는 것이 상대의 주장이기도 합니다. 이번 재판은 앞으로 중요한 사례가 될 수 있습니다. AI타임스 news@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204329",
  "article_id": "7d3c81",
  "cached_at": "2025-12-17T15:05:26.388078+00:00",
  "version": "V1.0"
}