{
  "title": "[12월4일] 클로드를 만든 앤트로픽은 클로드를 어떻게 사용할까",
  "summary": "앤트로픽은 3일(현지시간) 공식 블로그를 통해 'AI가 앤트로픽의 업무를 어떻게 변화시키고 있는가'라는 글을 올렸습니다. '클로드'를 만든 앤트로픽 직원들은 이를 어떻게 활용하고 있는지를 보여주는 내용입니다.앤트로픽은 AI가 경제에 미치는 영향을 연구한 '경제 지수(Economic Index)'를 지난 9월 내놓은 바 있습니다. 당시에는 기업들은 ‘클로드’를 인간 능력을 증강하는 데 투입하기보다 인간을 배제한 완전 자동화에 주로 활용하는 것으로 나타났다는 것이 핵심이었습니다.이처럼 다양한 직종을 포괄한 노동 시장 전체를 살펴본 데",
  "published_at": "2025-12-05T07:00:00+09:00",
  "modified_at": "2025-12-05T07:00:00+09:00",
  "author": [
    "AI타임스"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204505_205743_1224.png",
  "text": "(사진=앤트로픽) 앤트로픽은 3일(현지시간) 공식 블로그를 통해 ' AI가 앤트로픽의 업무를 어떻게 변화시키고 있는가 '라는 글을 올렸습니다. '클로드'를 만든 앤트로픽 직원들은 이를 어떻게 활용하고 있는지를 보여주는 내용입니다. 앤트로픽은 AI가 경제에 미치는 영향을 연구한 ' 경제 지수(Economic Index) '를 지난 9월 내놓은 바 있습니다. 당시에는 기업들은 ‘클로드’를 인간 능력을 증강하는 데 투입하기보다 인간을 배제한 완전 자동화에 주로 활용하는 것으로 나타났다는 것이 핵심이었습니다. 이처럼 다양한 직종을 포괄한 노동 시장 전체를 살펴본 데 이어, 이번에는 이 기술을 개발하고 가장 먼저 도입한 자신들의 행태를 연구한 것입니다. 앤트로픽은 \"AI를 개발하는 기업에서 AI의 영향을 연구하는 것은 특권적인 위치를 대변한다는 것을 인지하고 있다\"라며 \"하지만, 앤트로픽 내부에서 일어나는 일들이 광범위한 사회 변혁의 교훈적인 전조가 될 수 있기 때문에, 이런 연구 결과를 발표하는 것이 유용하다고 생각했다\"라고 밝혔습니다. 그리고 지난 8월 앤트로픽 엔지니어와 연구원 132명을 대상으로 설문조사를 실시하고, 클로드 코드의 내부 사용 데이터를 분석한 결과를 공개했습니다. 결론은 예상하는 대로입니다. \"AI 활용이 소프트웨어 개발자의 업무 방식을 근본적으로 변화시키고 있으며, 이는 희망과 우려를 동시에 불러일으키고 있음을 확인했다\"라는 내용입니다. 하지만, 세부 내용은 주목할만 것이 많습니다. 우선 앤트로픽 직원들은 업무의 59%에서 클로드를 사용하고 있다고 응답했습니다. 특히, 클로드 코드를 디버깅 작업(54%)에 가장 많이 활용하는 것으로 나타났습니다. 이어 코드 베이스 이해 및 탐색(42%), 새로운 기능 구현(37%) 등의 순이었습니다. 프런트엔드 개발은 7%에 그쳤습니다. 생산성 향상은 1년 전과 비교해 매우 두드러진 것으로 나타났습니다. 12개월 전 직원들은 일상 업무의 28%에 클로드를 사용해 생산성이 20% 증가했다고 밝혔지만, 지금은 업무의 59%에 사용해 평균적으로 생산성이 50% 증가했다고 보고했습니다. 이는 엔지니어링 조직 전체에 클로드 코드를 도입했을 때 엔지니어 1인당 하루에 병합된 풀 리퀘스트가 67% 증가한 것과 대략 맞아떨어지는 수치라고 합니다. 이처럼 1년 사이에 생산성 향상이 2배로 늘었다는 내용입니다. 특히, 응답자의 14%는 클로드를 사용해 생산성을 100% 이상 증가시켰다고 밝혔는데, 이들은 앤트로픽에서도 손꼽히는 '파워 유저'라고 합니다. 하지만 \"데이터를 더 깊이 파고들면 어떤 직원들은 클로드를 사용하는 작업에 훨씬 더 많은 시간을 소비했다\"라고 지적했습니다. 이는 클로드가 작성한 코드를 디버깅하고 정리하는 데 시간이 많이 들어갔다는 것입니다. 이전에도 외부 연구로 비슷한 사례가 알려진 바 있습니다. 숙련 개발자는 '바이브 코딩'으로 작업 시간이 준 것이 아니라, 더 늘었다는 것 입니다. 일일 코딩 업무에 AI를 활용한 사용자 비율 (사진=앤트로픽) AI로 인한 업무의 질적 변화에서 가장 눈길을 끄는 것은 개발자들의 '풀 스택(Full-stack)'화입니다. 즉, 클로드가 엔지니어들이 이전에 시도하기 어려웠던 프론트엔드나 트랜잭션 데이터베이스 작업 등 전문 분야를 넘어 더 광범위한 작업을 수행할 수 있게 도와줬다는 것입니다. 직원들은 클로드의 도움을 받은 작업의 27%가 AI가 없었다면 수행하지 않았을 새로운 유형의 업무라고 추정했습니다. 여기에는 프로젝트 확장뿐만 아니라, '사소하지만 불편했던 문제(papercuts)' 해결, 그리고 탐색적 작업 등이 포함됩니다. 또 다른 연구원은 클로드의 여러 버전을 동시에 실행, 문제에 대한 다양한 접근 방식을 탐구했다고 설명했습니다. 이처럼 클로드를 자주 사용하지만, AI 완전히 신용하지는 않는 것으로 나타났습니다. 절반 이상은 클로드에게 업무의 ​​0~20%만 \"완전히 위임할 수 있다\"라고 답했습니다. 그리고 쉽게 검증할 수 있는 작업이나 위험도가 낮은 작업, 지루한 작업을 클로드에 맡겼으며, 복잡한 작업이나 코드 품질 기준이 중요한 고위험 영역에서는 클로드의 결과물을 철저하게 검증한다고 밝혔습니다. 이런 점은 숙련자들이 클로드를 활용할 때 시간이 늘어난 것과 관련이 있습니다. 마지막으로, 세계에서 가장 앞선 AI 기업인 앤트로픽 직원들도 AI에 대한 우려는 비슷한 것으로 나타났습니다. 이는 크게 3가지 분야로 요약됩니다. 우선 AI가 코딩 작업을 대신하면서, 엔지니어들은 자신들의 기술 역량이 쇠퇴할 것을 걱정했습니다. 쉬운 결과물 생산에 익숙해지면서, 코드를 작성하고 비판하는 데 필요한 깊은 기술 학습에 시간을 덜 투자하게 된다는 것입니다. 또 AI가 생성한 코드가 점점 더 복잡해짐에 따라, 이를 효과적으로 검토하고 오류를 찾아낼 능력을 유지할 수 있을지 의문을 제기했습니다. 두번째로 AI 도입에 따라 직원 간의 상호작용도 변하는 것으로 나타났습니다. 즉, 기존에는 동료나 선배들에게 질문했던 문제를 이제는 콜로드에게 가장 먼저 묻는다는 것입니다. 이로 인해 동료 간의 협력이나 신입 직원에게 지식과 경험을 전달하는 멘토링 기회가 줄어든다는 것입니다. 한 응답자는 \"사람들과 함께 일하는 것을 좋아하는데, 이제 그들을 '덜 필요로' 하게 돼 슬프다\"라며 \"후배들이 나에게 질문하러 오는 횟수가 예전만큼 많지 않다\"라고 말했습니다. 일부 엔지니어들은 코드를 직접 작성하는 '장인 정신(coding craft)'과 그 과정에서 오는 즐거움을 그리워한다고 언급했습니다. 마지막으로 앤트로픽 직원들도 AI로 인한 일자리 불안은 외부와 비슷한 것으로 나타났습니다. 엔지니어들은 AI 시스템을 관리하는 등 고수준(higher-level)의 작업으로 역할이 바뀌고 있다고 밝혔지만, 이런 변화가 장기적으로 소프트웨어 엔지니어링 직업 자체에 어떤 의미를 가질지는 의문을 표했습니다. 일부는 \"단기적으로는 낙관적이지만, 장기적으로 AI가 결국 모든 것을 하게 돼 많은 사람을 무의미하게 만들 것으로 생각한다\"라고 불안감을 나타냈습니다. 또 많은 직원이 몇년 안에 자신의 역할이 어떻게 변할지 단언하기 어렵다며, 직업의 장기 비전이 불투명하다고 답했습니다. 이처럼 강력한 AI는 생산성 향상을 가져오지만, 기술 전문성 유지와 동료 간의 협업, 경력에 대한 비전 등에서 의문을 제기한다는 것이 결론입니다. 앤트로픽은 \"아직 초기 단계\"라고 강조했습니다. 이 회사에는 다른 곳보다 얼리어답터가 많고 가장 빠르게 환경이 변화하고 있기 때문에, 이번 결과가 다른 조직에 일반화되기는 어려울 것으로 봤습니다. 또 조사 결과는 미묘하며 정확하게 무엇으로 결론 내리기 어려운 부분이 많다는 것입니다. 이 때문에 2026년에는 더욱 구체적인 연구를 진행할 예정이라고 밝혔습니다. \"앤트로픽은 책임감 있는 직장 전환을 위한 실험실\"이라며 \"AI가 업무를 어떻게 변화시키는지 연구하는 것뿐만 아니라, 우리 자신부터 시작하여 그 변화를 신중하게 헤쳐나가는 방법을 실험하고 싶다\"라며 글을 맺었습니다. 앤트로픽이 밝혔듯 이 사례는 일반적인 회사보다 몇개월은 앞선 상황으로 볼 수 있습니다. 이는 몇개월 뒤 다른 회사도 비슷한 상황을 겪을 수 있다는 것을 말합니다. 그리고 세계에서 가장 뛰어난 코딩 도구를 가장 먼저, 가장 적극적으로 사용하는 사람들도 문제와 고민은 다른 곳과 큰 차이가 없다는 것을 엿볼 수 있는 결과입니다. 이어 3일 주요 뉴스입니다. (사진=콰이쇼우) ■ 클링, 생성·편집·이해 가능한 통합 모델 출시...\"동영상의 나노 바나나\" 클링이 동영상 생성은 물론, 편집까지 가능한 모델을 오픈 소스로 출시했습니다. 이 때문에 이미지 편집에서 탁월한 나노 바나나와 비교되고 있습니다. 동영상 AI 분야에서 중국의 발전이 놀랍습니다. ■ 오픈AI, 사전훈련 개선한 '갈릭' 모델 내년 출시...'코드 레드'도 발령 오픈AI가 제미나이 3로 인해 비상사태를 선포하고, 차기 모델 개발에 올인한다는 소식입니다. 이미 두차례의 프로젝트를 거쳐 모델 완성 단계에 도달한 것으로 알려졌습니다. 정상을 탈환할 수 있다는 판단인 것으로 알려졌습니다. ■ 구글, 'AI 모드'로 모바일 검색 전면 교체 시작 구글이 모바일 검색을 AI로 전면 교체하는 작업에 들어갔습니다. 이는 제미나이 3의 앞선 성능에 따른 자신감으로 볼 수 있는데, 이를 통해 오픈AI나 퍼플렉시티의 AI 검색 추격을 뿌리치겠다는 의도입니다. AI타임스 news@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204505",
  "article_id": "858e6d",
  "cached_at": "2025-12-17T15:05:17.991939+00:00",
  "version": "V1.0"
}