{
  "title": "전남, 의대 정원 최소 100명…대학병원은 동·서부권 분산",
  "summary": "전라남도가 수십 년간 풀지 못한 숙원인 '국립의과대학 설립'이 구체적인 실행 국면으로 접어들고 있다. 전남도는 17일 김용범 대통령실 정책실장 주재로 김영록 전남도지사, 송하철 국립목포대 총장, 이병운 국립순천대 총장이 회동하고, 국립목포대와 국립순천대를 통합한 '전남 통합대학교' 설립과 그 산하 국립의과대학 신설을 신속히 추진하기로 의견을 모았다.이번 회동은 단순한 의대 유치 선언을 넘어 ▲대학 통합 방식 ▲의대 정원 규모 ▲대학병원 설립 구상 ▲개교 시점 등 핵심 쟁점을 사실상 정리했다는 점에서 의미가 크다.통합대학교는 목포대와",
  "published_at": "2025-12-17T15:55:00+09:00",
  "modified_at": "2025-12-17T17:00:50+09:00",
  "author": [
    "양준석 기자"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204875_206257_5258.jpg",
  "text": "전라남도가 수십 년간 풀지 못한 숙원인 '국립의과대학 설립'이 구체적인 실행 국면으로 접어들고 있다. 17일 광주에서 대통령실 김용범 정책실장 주재로 열린 '전남 통합대학교 국립의과대학 신설 추진 간담회'. 김용범 정책실장, 김영록 지사, 송하철 국립목포대학교 총장, 이병운 국립순천대학교 총장 등 참석자들. (사진=전남도) 전남도는 17일 김용범 대통령실 정책실장 주재로 김영록 전남도지사, 송하철 국립목포대 총장, 이병운 국립순천대 총장이 회동하고, 국립목포대와 국립순천대를 통합한 '전남 통합대학교' 설립과 그 산하 국립의과대학 신설을 신속히 추진하기로 의견을 모았다. 이번 회동은 단순한 의대 유치 선언을 넘어 ▲대학 통합 방식 ▲의대 정원 규모 ▲대학병원 설립 구상 ▲개교 시점 등 핵심 쟁점을 사실상 정리했다는 점에서 의미가 크다. 통합대학교는 목포대와 순천대를 하나의 법인으로 묶되, 각 캠퍼스의 자율성과 독립성을 유지하는 방식으로 운영된다. 캠퍼스별 총장을 두는 '유연한 통합 모델'이 적용될 예정이다. 이는 대학 통합 과정에서 반복돼온 지역 갈등과 기능 축소 우려를 최소화하려는 절충안으로, 국내에서는 사실상 첫 사례다. 전남도 관계자는 \"행정과 재정은 통합하되, 교육·연구·지역 연계 기능은 각 캠퍼스가 특성화하는 구조\"라며 \"의과대학과 대학병원이라는 대형 인프라를 감당하기 위한 불가피한 선택\"이라고 설명했다. 의과대학은 2027학년도 개교를 목표로 추진된다. 정원은 최소 100명 이상으로 설정하는 데 의견이 모아졌으며, 이는 전남 지역 의료 수요와 공공의료 기능을 고려한 규모다. 의대 설립과 동시에 대학병원 건립도 병행된다. 전남 동부권과 서부권에 각각 500병상 이상 규모의 상급종합병원급 대학병원을 설립해, 특정 지역에 의료 인프라가 쏠리는 문제를 방지하겠다는 구상이다. 이는 단순한 의대 설립을 넘어, 전남 의료체계 전반을 재편하는 계획으로 평가된다. 목포대-순천대 (AI타임스DB) 관건은 '속도'와 '정부 승인' 과제도 분명하다. 우선 교육부의 대학 통합 승인과 의대 신설 인가라는 두 개의 행정 절차를 동시에 통과해야 한다. 특히 의대 정원 배정은 전국적인 의대 증원 논의와 맞물려 있어, 정부의 정책 판단이 변수로 작용할 가능성이 크다. 또한 대학병원 설립에는 막대한 재정이 투입되는 만큼, 국비 지원과 공공의료 재정 투입 방식에 대한 구체적인 로드맵 마련이 필요하다. 전남도는 이번 사업을 '글로컬대학 통합' 모델로 규정하고, 정부의 국가균형발전 정책과 '서울대 10개 만들기' 구상과 연계해 재정·제도적 지원을 끌어낸다는 방침이다. 전남은 전국 최대 의료 취약지이자, 광역자치단체 중 유일하게 의과대학이 없는 지역이다. 이번 통합 국립의대 설립은 지역 의료 격차 해소를 넘어, 지방소멸 위기에 대응하는 구조적 전환의 시험대가 될 전망이다. 대통령실과 전남도는 \"의대 없는 지역에 의대를 신설한다는 국정과제가 선언에 그치지 않도록, 통합대학 설립부터 개교까지 전 과정을 관리하겠다\"며 후속 절차를 예고했다. 이제 남은 것은 계획이 아니라 실행이다. 전남 통합 국립의대 구상이 실제 개교로 이어질 수 있을지, 향후 2년이 분수령이 될 것으로 보인다. 양준석 기자 kailas21@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204875",
  "article_id": "91ce2d",
  "cached_at": "2025-12-17T15:05:59.112689+00:00",
  "version": "V1.0"
}