{
  "title": "송전망 확충, 더 이상 '만능 해법'이 아니다...에너지 정책 선택의 기로",
  "summary": "국가 전력 정책의 중심축이 흔들리고 있다. 수도권 전력 수요를 충당하기 위해 비수도권에서 생산된 전력을 끌어오는 방식은 한계에 다다랐다는 평가가 잇따른다. 송전선로 신설에는 막대한 재정 투입과 함께 지역 주민의 반발, 환경 훼손 논란이 반복되고 있으며, 사업 하나를 완공하는 데 수년이 소요되는 경우도 적지 않다.문제는 이러한 비용과 갈등을 감수하더라도, 수도권 내부에서 추가적인 대규모 재생에너지 발전 부지를 확보하기는 현실적으로 어렵다는 점이다. 에너지 생산은 지방에서, 소비는 수도권에서 이뤄지는 구조가 고착화되면서 전력 계통의 병",
  "published_at": "2025-12-16T10:00:34+09:00",
  "modified_at": "2025-12-16T10:00:34+09:00",
  "author": [
    "양준석 기자"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204823_206191_5752.jpg",
  "text": "국가 전력 정책의 중심축이 흔들리고 있다. 수도권 전력 수요를 충당하기 위해 비수도권에서 생산된 전력을 끌어오는 방식은 한계에 다다랐다는 평가가 잇따른다. 송전망 신설 등에 막대한 비용과 갈등이 초래되는 만큼 기업이 재생에너지가 풍부한 지역으로 내려가는 것이 유일한 해법이라는 주장이 강하게 제기됐다. ((사)에너지전환포럼) 송전선로 신설에는 막대한 재정 투입과 함께 지역 주민의 반발, 환경 훼손 논란이 반복되고 있으며, 사업 하나를 완공하는 데 수년이 소요되는 경우도 적지 않다. 문제는 이러한 비용과 갈등을 감수하더라도, 수도권 내부에서 추가적인 대규모 재생에너지 발전 부지를 확보하기는 현실적으로 어렵다는 점이다. 에너지 생산은 지방에서, 소비는 수도권에서 이뤄지는 구조가 고착화되면서 전력 계통의 병목과 지역 간 갈등은 더욱 심화되고 있다. 이 같은 상황에서 최근 국회와 전문가, 산업계에서는 \"송전망을 늘리는 방식이 아니라, 재생에너지가 풍부한 지역으로 기업과 산업이 이동해야 한다\"는 주장이 힘을 얻고 있다. 전력 이동 중심의 사고에서 산업 입지 전환 중심의 전략으로 패러다임을 바꿔야 한다는 것이다. 전남, '전력 공급지'를 넘어 '에너지 산업 거점'으로 이러한 논의의 중심에 전라남도가 있다. 전남은 전국에서 가장 풍부한 태양광·해상풍력 잠재력을 보유한 지역으로, 이미 국내 재생에너지 발전 설비의 상당 부분이 집중돼 있다. 특히 서남해안을 중심으로 한 해상풍력 자원과 광활한 농촌·연안 지역은 대규모 재생에너지 집적이 가능한 최적의 조건으로 평가된다. 전남의 강점은 단순히 발전량에 그치지 않는다. 비교적 넓은 가용 부지, 낮은 인구 밀도, 재생에너지에 대한 지역 사회의 수용성, 그리고 지자체의 정책 추진 경험은 에너지 생산-산업-주거를 함께 설계할 수 있는 기반으로 작용한다. 최근 글로벌 기업들이 요구하는 RE100(재생에너지 100% 사용) 기준 역시 전남의 경쟁력을 부각시키는 요소다. 데이터센터, 반도체, AI 산업 등 전력 다소비 산업은 전기요금 안정성과 탄소 규제 대응이 핵심인데, 재생에너지가 풍부한 전남은 송전 비용과 계통 리스크를 최소화하면서도 RE100을 충족할 수 있는 지역으로 주목받고 있다. 전문가들은 전남이 ‘전기를 보내는 지역’에 머무르지 않고, 재생에너지 기반 산업과 일자리를 직접 품는 구조로 전환할 수 있는 분기점에 서 있다고 진단한다. 영농형 태양광은 농업 생산을 유지한 채 태양광 발전을 병행하는 방식으로, 재생에너지 확대 과정에서 발생해 온 토지 이용 갈등을 완화할 수 있는 대안으로 평가된다. (사진=파루솔라) 재생에너지 자립도시, 법과 제도가 관건 관건은 제도다. 재생에너지 자립도시와 RE100 산업단지가 선언에 그치지 않기 위해서는 산업·에너지·전력 계통을 통합적으로 설계하는 법·제도적 틀이 필요하다는 지적이 나온다. 전문가들은 ▲산업·기업 지구 ▲재생에너지 집적화 지구 ▲분산형 전력망 ▲주거·정주 여건을 하나의 패키지로 지원하는 특별법 제정이 시급하다고 강조한다. 이는 기업 이전을 유도하는 인센티브 제공은 물론, 지역 주민의 삶의 질과 지속 가능한 정주 환경까지 함께 고려해야 한다는 의미다. 또한 재생에너지 전력의 지역 내 우선 사용, 장기 전력 가격 안정 장치, 분산형 전력망에 대한 규제 완화 등도 병행돼야 한다. 단순히 발전 설비만 늘리는 방식으로는 에너지 전환도, 지역 균형 발전도 달성하기 어렵다는 것이 공통된 인식이다. 송전망을 계속 확충할 것인가, 아니면 재생에너지가 있는 곳으로 산업과 일자리를 이동시킬 것인가는 단순한 기술 문제가 아니다. 이는 국가 경쟁력, 지역 균형 발전, 전력 요금, 기후 위기 대응이 얽힌 사회적 선택의 문제다. 전남은 그 선택지 가운데 가장 현실적인 대안을 제시하는 지역으로 떠오르고 있다. 재생에너지 보고라는 자연적 조건에 더해, 산업 전환을 수용할 수 있는 공간과 경험을 갖춘 곳이기 때문이다. 에너지를 끌어오는 시대에서, 에너지가 있는 곳으로 가는 시대. 전남은 이제 대한민국 에너지 전환 전략의 변방이 아니라, 핵심 무대가 되고 있다. 양준석 기자 kailas21@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204823",
  "article_id": "9463c1",
  "cached_at": "2025-12-17T15:06:29.005353+00:00"
}