{
  "title": "[12월3일] 36시간 잠 안 자고 작업한 xAI 직원과 동료들의 칭찬",
  "summary": "xAI의 한 직원이 36시간 동안 잠을 안 자고 작업에 매달렸다는 글을 올렸습니다.파르사 타지크라는 기술 스태프는 지난달 28일(현지시간) X(트위터)를 통해 테슬라 사이버트럭 안에서 찍은 사진과 함께 &quot;어젯밤 사무실에서 36시간 동안 잠을 못 자고 일한 후 나왔다&quot;라는 글을 남겼습니다. 그는 &quot;몸은 죽은 것 같았지만, 엄청난 에너지가 넘쳤다. 이 팀의 일원이 돼 정말 감사하다. 즐거운 추수감사절 보내세요!&quot;라고 덧붙였습니다.이 글은 엄청난 반응을 일으켰습니다. 조회수는 993만건을 넘었고, 댓글은 1400여개가 달렸습니다. '좋아",
  "published_at": "2025-12-04T07:00:00+09:00",
  "modified_at": "2025-12-04T07:00:00+09:00",
  "author": [
    "AI타임스"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204463_205688_36.png",
  "text": "기사를 읽어드립니다. (사진=셔터스톡) xAI의 한 직원이 36시간 동안 잠을 안 자고 작업에 매달렸다는 글을 올렸습니다. 파르사 타지크 라는 기술 스태프는 지난달 28일(현지시간) X(트위터)를 통해 테슬라 사이버트럭 안에서 찍은 사진과 함께 \"어젯밤 사무실에서 36시간 동안 잠을 못 자고 일한 후 나왔다\"라는 글을 남겼습니다. 그는 \"몸은 죽은 것 같았지만, 엄청난 에너지가 넘쳤다. 이 팀의 일원이 돼 정말 감사하다. 즐거운 추수감사절 보내세요!\"라고 덧붙였습니다. 이 글은 엄청난 반응을 일으켰습니다. 조회수는 993만건을 넘었고, 댓글은 1400여개가 달렸습니다. '좋아요'도 1만1000건에 달합니다. 댓글에는 xAI 직원들의 칭찬이 이어졌습니다. 에릭 지앙이라는 직원은 \"그리고 총 192시간 분량의 작업을 끝냈다. 당신은 유니콘 중의 유니콘\"이라고 말했습니다. 다른 직원은 \"당신과 일하고, 배울 수 있어서 정말 감사하다\"라고 썼습니다. 물론, 반대 의견과 비판도 쏟아졌습니다. 한 사용자는 \"일만 열심히 한 고인의 명복을 빈다\"라는 묘비 사진을 올리며 비꼬았고, \"이건 당신과 고용주 모두에게 매우 무모한 짓\"이라는 비난도 나왔습니다. 일부는 32시간 동안 잠을 안 잔 상태에서 운전하는 것이 법적으로도 매우 위험하다고 지적했습니다. 이에 대해 타지크는 \"FSD 모드로 운전해 귀가했다\"라고 해명했습니다. 특히 다음날에는 아유시 자이스왈 이라는 xAI의 임원이 이를 포스팅하며 불을 붙였습니다. 그는 \"워라밸은 정말 훌륭해서, 사실 모든 경쟁사에도 추천하고 있다. 이 글에 화내지 말라. 의견이 달라도 괜찮다. 우리가 알아서 할 것\"이라고 설명했습니다. 이 말은 xAI에서는 워라밸이 사실상 존재하지 않을 정도로 열심히 일하고 있다는 사실을 표현한 것입니다. 경쟁사들에 추천한다는 말은 '우리는 열심히 할 테니, 너희는 워라밸이나 챙겨라'라고 해석할 수 있습니다. 그리고 일론 머스크 CEO는 그의 글에 울고 웃는 이모티콘으로 응답했습니다. 실리콘 밸리에서 강도 높은 근무로 논란이 일어난 것은 어제오늘의 일은 아닙니다. 최근에는 많은 스타트업이 9-9-6 , 즉 오전 9시부터 오후 9시까지 주 6일 근무하는 행태로 화제가 됐습니다. 특히 자이스왈이 워라밸은 훌륭해서 경쟁사에 추천한다는 말은 지난해 논란을 일으켰던 다른 회사 CEO의 말을 그대로 인용한 것입니다. 아디트 팔리치 젭토 CEO는 지난해 같은 내용의 게시물을 올렸다가, 엄청난 논란에 휩싸였습니다. 그리고 이번 글이 xAI에서 나왔다는 것에 대해서는 대부분 \"그럴 만하다\"라는 반응입니다. 머스크 CEO는 이전부터 하드코어한 근무 문화로 유명했기 때문입니다. 이런 분위기를 못 견디면 입사가 불가능한 것으로도 잘 알려져 있습니다. 그는 테슬라 모델 3을 출시할 당시, 공장 바닥에서 잠을 잤던 사진으로 유명합니다. 나중에는 연출된 것이라는 주장도 나오기는 했습니다. 또, 지난 5월에는 트럼프 행정부의 임기를 마치고 회사로 복귀하며, \" 24시간 내내 직장에서 일하고 회의실/서버실/공장에서 자는 일상으로 돌아갔다 \"라고 밝히기도 했습니다. 최근 xAI는 내부적으로 복잡한 일을 겪고 본격적인 차기 모델 개발을 시작한 것으로 알려졌습니다. 9월 이후 100명 이상의 직원을 감축한 것으로 알려졌습니다. 또 머스크 CEO는 '그록-5'를 내년 초 출시 하겠다고 예고한 바 있습니다. xAI는 매우 빠른 속도로 성장했습니다. 2023년 12월 처음으로 '그록'을 출시한 이후 2년여 만에 '그록-4'까지 내놓았습니다. 그록은 이제는 오픈AI나 구글과 맞먹는 수준의 성능을 보이며, xAI는 세계 최고의 AI 연구실 중 하나로 꼽히고 있습니다. 이런 급성장의 동력이 무엇인지를 이번 X 게시글이 잘 보여주고 있다는 평입니다. 실제로 이번에 워라밸을 거론한 자이스왈은 지난 11월4일에도 비슷한 게시물을 올렸습니다. 그는 \"팔로알토에 있는 xAI 사무실의 분위기는 매우 독특하다. 믿을 수 없을 만큼 강렬한 분위기 속에서도 악의나 정치적인 요소는 전혀 없다\"라고 소개했습니다. 당시 사용자들은 개발자를 위해 매우 좋은 환경이라고 부러움을 표시했습니다. \"진지한 업무와 발전을 위한 훌륭한 환경\" \"좋아하는 일을 열심히 하는 게 세상에서 가장 좋은 것\" 등의 반응이 이어졌습니다. 머스크 CEO도 근무 효율을 높이기 위해서는 파격적인 지원을 하는 것으로 알려졌습니다. 한 xAI 직원이 사무실 근처에 피자가 형편이 없다는 글을 올리자, 이를 발견한 머스크 CEO가 사무실 안에 '나무 화덕 피자 오븐을 설치해 주겠다고 약속한 것입니다. (사진=셔터스톡) 그리고 더욱 중요한 것은 xAI뿐만 아니라, 구글의 '제미나이 3' 등장으로 인해 치열한 추격전이 펼쳐지고 있다는 점을 보여주는 에피소드라는 점입니다. 샘 알트먼 오픈AI CEO는 추수 감사절 연휴가 끝난 직후 1일 내부에 '코드 레드'를 발령 했습니다. 그리고 모델 개발에 모든 리소스를 집중하겠다고 선언했습니다. 이미 지난 10월부터 제미나이 3에 대한 정보를 접하고 치열한 모델 개발 준비를 해온 것으로 알려졌습니다. 불과 두달 만에 '샬롯피트'라는 프로젝트에 이어 '갈릭'이라는 프로젝트까지 두개의 사전 훈련을 마쳤다는 것이 그 증거입니다. 현재 프론티어 모델 경쟁은 구글과 오픈AI, 앤트로픽, xAI, 메타 등으로 압축되고 있습니다. 그리고 이번 제미나이 3 등장으로 다른 곳들이 어떤 압박을 받고 있는지는 설명이 필요 없을 듯 합니다. 마다비 세왁이라는 구글 연구원도 \"모두가 항상 일하고 있다. 멈출 지점이 보이지 않는다. 좋은 아이디어를 떠올릴 때마다 이를 놓치지 않으려고 새벽에도 실험을 반복한다\"라고 밝혔습니다. 이 때문에 순다르 피차이 CEO는 \" 일부 직원은 휴식이 필요하다 \"라고 밝힐 정도였습니다. 그리고 연휴가 끝나면 바로 차기 모델 개발에 착수할 뜻을 비쳤습니다. 경쟁사들이 만약 차기 모델이 제미나이 3를 넘어서지 못했다는 평을 받으면, 어떤 일이 일어날지도 뻔합니다. 밤샘 작업은 아마도 xAI의 일만은 아닐 것으로 보입니다. 국내에서도 국가대표 모델 개발을 진행 중인 연구진이 눈코 뜰새없이 바쁘다는 소식이 전해집니다. 한편, 논란이 시작된 게시물을 올린 타지크는 이렇게 썼습니다. \"나는 오랫동안 오랜 시간 일해 왔다. 2020년에 거의 노숙자 신세에서 벗어나 xAI에 합류할 수 있었던 건 바로 이런 과정 덕분이다. 뛰어난 결과를 얻으려면 뛰어난 노력이 필요하다. 지금은 속도를 늦출 때가 아니다.\" 이어 2일 주요 뉴스입니다. ■ 딥시크, 제미나이 3·GPT-5와 맞먹는 새 모델 2종 오픈 소스 공개 딥시크가 글로벌 프론티어급의 새 모델 2종을 출시했습니다. 그러나 R1의 임팩트가 워낙 컸던 탓인지, 제미나이 3나 GPT-5에 맞먹는 성능이라는 점으로는 크게 어필하지 못하는 것으로 보입니다. ■ 런웨이, 벤치마크에서 '비오 3' 제친 동영상 생성 모델 출시 런웨이가 비오 3보다 성능이 뛰어나다는 모델을 내놓았습니다. 특히 물리 시뮬레이션에 뛰어나다고 합니다. 다만, 구글이나 오픈AI의 엄청난 배포 능력을 어떻게 따라잡을지는 의문입니다. (사진=인스타그램, @zoeilanahill) ■ AI 콘텐츠도 귀여우면 괜찮아...SNS에 'AI 동물' 콘텐츠 열풍 AI 생성도 잘 쓰면 인기를 얻을 수 있다는 사례가 등장했습니다. 바로 실제 사진에 동물 합성을 추가하는 것입니다. 동물은 이전부터 대표적인 마케팅 선호 콘텐츠였습니다. AI 시대에도 이런 점이 통한다고 볼 수 있습니다. AI타임스 news@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204463",
  "article_id": "9d5272",
  "cached_at": "2025-12-17T15:05:19.779220+00:00"
}