{
  "title": "인공태양 품은 전남 나주…&quot;연구 유치 넘어 산업·도시까지 바뀐다&quot;",
  "summary": "전라남도와 나주시가 국가 핵융합 연구시설, 이른바 '인공태양' 연구시설 유치를 계기로 전남 경제 구조 전환과 지역 발전의 새로운 전기를 맞고 있다. 단순한 대형 국책 연구시설 유치를 넘어, 향후 산업·고용·인구 구조까지 바꾸는 장기 프로젝트가 될 수 있을지 주목된다.전남도와 나주시는 지난 16일 나주종합스포츠파크 다목적체육관에서 국비 1조 2천억 원 규모의 국가 핵융합 연구시설 유치 기념행사를 열고, 도민들과 성과를 공유했다. '대한민국 에너지 수도 전남 나주, 인공태양을 품다!'를 슬로건으로 열린 이날 행사에는 전남도와 나주시 관",
  "published_at": "2025-12-17T11:05:14+09:00",
  "modified_at": "2025-12-17T11:05:14+09:00",
  "author": [
    "양준석 기자"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204857_206232_323.jpg",
  "text": "전라남도와 나주시가 국가 핵융합 연구시설, 이른바 '인공태양' 연구시설 유치를 계기로 전남 경제 구조 전환과 지역 발전의 새로운 전기를 맞고 있다. 단순한 대형 국책 연구시설 유치를 넘어, 향후 산업·고용·인구 구조까지 바꾸는 장기 프로젝트가 될 수 있을지 주목된다. 강위원 전라남도 경제부지사가 16일 나주종합스포츠파크 다목적체육관에서 열린 인공태양 연구시설 유치 환영 행사에서 주요 내빈 및 참석자들과 비전선포 세리머니를 하고 있다. (사진=전남도) 전남도와 나주시는 지난 16일 나주종합스포츠파크 다목적체육관에서 국비 1조 2천억 원 규모의 국가 핵융합 연구시설 유치 기념행사를 열고, 도민들과 성과를 공유했다. '대한민국 에너지 수도 전남 나주, 인공태양을 품다!'를 슬로건으로 열린 이날 행사에는 전남도와 나주시 관계자, 국회의원, 산학연 인사, 도민 등 900여 명이 참석해 유치의 의미를 함께 나눴다. 전남도는 이번 유치를 통해 대한민국 최초의 핵융합 전용 연구 인프라를 확보하게 됐으며, 향후 연관 기업 300개 유치와 1만 명의 고용 창출, 약 10조 원 규모의 경제 파급 효과를 기대하고 있다. 그러나 전문가들은 이번 성과의 진짜 가치는 '유치 그 자체'가 아니라, 연구 성과를 산업과 일자리로 연결할 수 있느냐에 달려 있다고 지적한다. 실제 인공태양 연구시설이 들어서면 단기적으로는 대규모 건설과 장비 도입, 운영 준비 과정에서 지역경제에 직접적인 활력이 돌 것으로 전망된다. 연구동과 시험동 건설, 도로·전력 등 기반시설 확충, 초전도 자석과 고진공 장비, 정밀 제어 시스템 등 첨단 장비 발주가 이어지면서 건설·제조·서비스 분야의 매출 증가가 기대된다. 숙박·외식·교통 등 지역 상권에도 파급 효과가 발생할 것으로 보인다. 다만 이 같은 단기 효과가 전남에 실질적으로 남기 위해서는 지역 기업이 조달·납품 구조에 얼마나 참여하느냐가 관건이다. 대형 발주가 외지 기업 중심으로 이뤄질 경우, 경제 효과가 지역 밖으로 빠져나갈 수 있다는 우려도 함께 제기된다. 중기적으로는 핵융합 연구를 기반으로 한 산업 생태계 구축 여부가 전남 경제의 향방을 좌우할 전망이다. 핵융합 기술은 초전도·냉각·전력장치, 고진공·플라즈마 장비, 특수 소재와 표면처리, 센서·제어·소프트웨어 등 다양한 분야로 확장 가능성이 크다. 이들 기술은 반도체, 디스플레이, 에너지 장비 등 기존 산업과의 연계도 용이해, 전남의 에너지·소재·기계 산업과 결합할 경우 산업 고도화의 촉매가 될 수 있다. 인공태양 이미지 (AI타임스DB) 전남도가 제시한 '연관 기업 300개' 역시 단순 숫자보다, 실제 생산과 연구 기능을 갖춘 기업이 지역에 정착하느냐가 중요하다는 분석이다. 핵심 기업과 공급망, 시험·인증·실증 인프라가 함께 구축돼야 기술 이전과 창업, 스핀오프 기업이 이어질 수 있다. 장기적으로는 인공태양 연구시설이 전남의 도시 구조와 인구 흐름까지 바꿀 수 있을지 관심이 쏠린다. 전남도는 세계 최고 수준의 과학자와 엔지니어가 모이는 국제 과학도시 조성을 목표로 내세우고 있다. 이를 위해서는 연구 환경뿐 아니라 주거·교육·의료·문화 등 정주 여건이 함께 갖춰져야 한다는 지적이 나온다. 연구직뿐 아니라 제조·서비스·교육 분야의 동반 일자리 창출도 지역 소멸 대응의 핵심 과제로 꼽힌다. 전남도는 도지사가 총괄하고 나주시장과 경제부지사가 공동 단장을 맡는 추진단을 구성해 예비타당성조사 대응과 연구시설 조기 구축에 나설 계획이다. 정부와 지자체, 지역 대학이 참여하는 협력 체계를 통해 연구시설 완공과 첨단 산업 생태계 조성을 동시에 추진한다는 구상이다. 지역 경제계 관계자는 \"이번 인공태양 연구시설 유치는 전남이 에너지 중심지에서 첨단 과학·산업 거점으로 도약할 수 있는 기회\"라며 \"연구 성과가 기업과 일자리로 이어질 수 있도록 지역 맞춤형 산업 전략과 인재 육성이 병행돼야 한다\"고 말했다. 인공태양을 품은 전남 나주가 '연구 유치의 성과'를 넘어 '산업과 도시의 변화'로 이어질 수 있을지, 앞으로의 실행력이 시험대에 올랐다. 양준석 기자 kailas21@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204857",
  "article_id": "9d6c0e",
  "cached_at": "2025-12-17T15:04:43.924471+00:00"
}