{
  "title": "미국, X 벌금 부과에 EU 기업 보복하겠다고 위협",
  "summary": "트럼프 행정부가 유럽연합(EU)의 디지털 규제와 제재가 미국 기업을 차별하고 있다며, 미국에서 활동하는 유럽 기업에 똑같이 수수료 부과나 규제 조치를 검토할 수 있다고 경고했다. 통상 갈등이 다시 고조되는 모습이다.미국무역대표부(USTR)는 16일(현지시간) 소셜미디어 X를 통해 EU와 일부 회원국이 미국 서비스 기업들을 상대로 “차별적이고 괴롭힘에 가까운 소송, 세금, 벌금, 지침을 적용하고 있다”라고 주장했다.하지만, 액센추어와 DHL, 지멘스, 스포티파이 등 유럽 기업들은 미국 시장에서 자유롭게 영업하고 있다고 지적했다.UST",
  "published_at": "2025-12-17T12:42:14+09:00",
  "modified_at": "2025-12-17T12:42:14+09:00",
  "author": [
    "박찬 기자"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204856_206234_1030.jpg",
  "text": "(사진=셔터스톡) 트럼프 행정부가 유럽연합(EU)의 디지털 규제와 제재가 미국 기업을 차별하고 있다며, 미국에서 활동하는 유럽 기업에 똑같이 수수료 부과나 규제 조치를 검토할 수 있다고 경고했다. 통상 갈등이 다시 고조되는 모습이다. 미국무역대표부(USTR)는 16일(현지시간) 소셜미디어 X를 통해 EU와 일부 회원국이 미국 서비스 기업들을 상대로 “차별적이고 괴롭힘에 가까운 소송, 세금, 벌금, 지침을 적용하고 있다”라고 주장했다. 하지만, 액센추어와 DHL, 지멘스, 스포티파이 등 유럽 기업들은 미국 시장에서 자유롭게 영업하고 있다고 지적했다. USTR는 “EU와 회원국들이 차별적 수단을 통해 미국 서비스 제공업체의 경쟁력을 계속 제한하고 억제한다면, 미국은 이러한 불합리한 조치에 대응하기 위해 가용한 모든 수단을 사용할 수밖에 없다”라고 밝혔다. 또 미국 법에 따라 외국 서비스에 대해 수수료 부과나 제한 조치를 취할 수 있다고 덧붙였다. 잠재적 대상으로는 아마데우스, 캡제미니, 미스트랄, 퍼블리시스, SAP 등 유럽 서비스 기업들이 거론됐다. The European Union and certain EU Member States have persisted in a continuing course of discriminatory and harassing lawsuits, taxes, fines, and directives against U.S. service providers. U.S. services companies provide substantial free services to EU citizens and reliable… — United States Trade Representative (@USTradeRep) December 16, 2025 이번 경고는 EU가 빅테크 규제를 본격화하는 시점과 맞물려 나왔다. EU 규제 당국은 이달 초 일론 머스크 CEO의 X에 1억2000만유로(약 2000억원)의 벌금을 부과했으며, 구글에는 29억5000만유로(약 5조원)에 달하는 대규모 과징금을 부과한 바 있다. 미국 정부는 이런 조치들이 자국 기업을 겨냥한 것이라고 보고 있다. 미국은 그간 EU의 디지털 법을 문제 삼아 왔으며, 미국산 철강 관세 인하를 EU의 디지털 규제 완화와 연계하거나 외교 채널을 통해 해당 법안에 대한 로비를 지시하는 등 압박 수위를 높여왔다. 이에 대해 유럽연합 집행위원회는 즉각 반박했다. 토마스 레니에 EU 집행위 대변인은 “우리의 규정은 EU에서 활동하는 모든 기업에 공정하고 동일하게 적용된다”라며 “시민들이 기대하는 안전하고 공정하며 경쟁이 가능한 시장 환경을 조성하기 위한 것”이라고 밝혔다. 또 집행 과정에서도 “어떠한 차별도 없다”라고 강조했다. 또 EU가 미국과의 공동성명에 따른 약속을 이행하고 있으며, 통상 현안에 대해 지속적으로 협의하고 있다고 덧붙였다. 박찬 기자 cpark@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204856",
  "article_id": "b5cc89",
  "cached_at": "2025-12-17T15:04:35.395054+00:00",
  "version": "V1.0"
}