{
  "title": "엔비디아, 다중 에이전트용 오픈 모델 '네모트론 3' 공개",
  "summary": "엔비디아가 차세대 에이전틱(agentic) AI 시대를 겨냥한 오픈 모델 전략을 본격화했다. 간판 모델인 네모트론의 최신 버전을 공개, 오픈 소스 생태계를 강화하고 GPU 사용 폭을 넓힌다는 전략이다.엔비디아는 15일(현지시각) 다중 에이전트 시스템 구축에 최적화된 ‘네모트론(Nemotron) 3’ 모델 군과 데이터, 라이브러리 등을 전면 공개했다.네모트론 3는 ▲소형·특화 작업에 최적화된 '네모트론 3 나노(Nano)' ▲다수의 AI 에이전트가 협업하는 환경을 겨냥한 '네모트론 3 슈퍼(Super)' ▲고난도 추론과 복잡한 업무를",
  "published_at": "2025-12-16T18:05:00+09:00",
  "modified_at": "2025-12-16T19:21:39+09:00",
  "author": [
    "박찬 기자"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204825_206194_415.png",
  "text": "기사를 읽어드립니다. (사진=엔비디아) 엔비디아가 차세대 에이전틱(agentic) AI 시대를 겨냥한 오픈 모델 전략을 본격화했다. 간판 모델인 네모트론의 최신 버전을 공개, 오픈 소스 생태계를 강화하고 GPU 사용 폭을 넓힌다는 전략이다. 엔비디아는 15일(현지시각) 다중 에이전트 시스템 구축에 최적화된 ‘네모트론(Nemotron) 3’ 모델 군과 데이터, 라이브러리 등을 전면 공개했다. 네모트론 3는 ▲소형·특화 작업에 최적화된 '네모트론 3 나노(Nano)' ▲다수의 AI 에이전트가 협업하는 환경을 겨냥한 '네모트론 3 슈퍼(Super)' ▲고난도 추론과 복잡한 업무를 수행하는 '네모트론 3 울트라(Ultra)' 등 세가지 모델로 구성된다. 젠슨 황 엔비디아 CEO는 “오픈 혁신은 AI 발전의 토대”라며 “네모트론을 통해 개발자들이 대규모 에이전트형 AI 시스템을 투명하고 효율적으로 구축할 수 있는 오픈 플랫폼을 제공하겠다”라고 밝혔다. 최근 AI는 단일 챗봇을 넘어 검색기, 계획 수립기, 도구 실행기, 검증기 등 여러 에이전트가 협력하는 형태로 진화하고 있다. 이런 시스템은 대규모 컨텍스트를 장시간 유지하면서도 높은 처리 속도와 안정적인 추론 성능을 요구한다. 네모트론 3는 이런 요구에 맞춰 하이브리드 '맘바(Mamba)-트랜스포머' 전문가 혼합(MoE) 아키텍처를 도입했다. 맘바 레이어는 긴 시퀀스를 효율적으로 처리해 수십만~수백만 토큰 규모의 장기 문맥을 유지하고, 트랜스포머 레이어는 코드 작성·수학 추론·복잡한 계획 수립에 필요한 정밀한 논리 처리를 담당한다. 여기에 MoE 라우팅을 결합해 토큰마다 일부 전문가만 활성화함으로써 지연 시간과 연산 비용을 줄였다. 이 구조는 다수의 경량 에이전트가 동시에 작동하는 환경에 적합하다는 평가다. 또 다른 특징은 네이티브 100만 토큰 컨텍스트 창으로, 이는 현재 사용 모델 중 가장 큰 편에 속한다. 이를 통해 대규모 코드베이스, 장문 문서, 장시간 대화, 방대한 검색 결과를 하나의 문맥 안에서 처리할 수 있어, 컨텍스트 분할로 인한 정보 손실을 크게 줄였다. 또 엔비디아는 오픈 소스 강화 학습(RL) 환경인 '네모 짐(NeMo Gym)'을 활용해 네모트론 3를 사후 훈련했다. 이는 최근 유행하는 'RL 짐'의 일종으로, 복잡한 실제 에이전트 업무 능력을 강화하는 것이다. 이를 통해 다단계 작업에서의 추론 드리프트를 줄이고, 실무형 에이전트 파이프라인에 적합한 행동 일관성을 확보했다는 설명이다. 벤치마크 결과 (사진=아티피셜 애널리시스) 현재 바로 사용할 수 있는 모델은 네모트론 3 나노다. 전체 300억 매개변수 중 최대 30억 매개변수만 활성화하는 구조로, 높은 처리량과 낮은 추론 비용이 강점이다. 이 모델은 벤치마킹 기관 아티피셜 애널리시스에서 효율성과 개방성 부문에서 최고 수준의 평가를 받았다. 네모트론 3 나노는 현재 허깅페이스를 비롯해 vLLM, SGLang, TensorRT-LLM 등 주요 추론 프레임워크에서 사용할 수 있으며, 다양한 ‘쿡북(cookbook)’을 통해 수분 내 배포가 가능하다. 슈퍼와 울트라 모델은 2026년 상반기 출시 예정이다. 이들 모델은 잠재(latent) 혼합 전문가(MoE) 구조를 도입해, 여러 전문가 모델이 공통의 잠재 표현 공간에서 연산한 뒤 결과를 다시 토큰 공간으로 투영하는 방식을 채택했다. 이를 통해 동일한 추론 비용으로 최대 4배 많은 전문가를 활용할 수 있어, 미묘한 의미적 구조나 도메인별 추상화, 다단계 추론 패턴에 대한 전문화가 강화된다는 설명이다. 또 다중 토큰 예측(MTP) 기술을 적용해 한번의 연산으로 여러개의 다음 토큰을 동시에 예측할 수 있도록 했다. 이로 인해 긴 추론 시퀀스나 구조화된 출력에서 처리량이 크게 향상되며, 계획 수립, 실행 경로(trajectory) 생성, 확장된 사고 사슬(CoT), 코드 생성과 같은 작업에서 지연 시간을 줄이고 에이전트의 응답성을 높인다. 여기에 엔비디아의 4비트 부동소수점 포맷 NVFP4를 활용해 대규모 모델 학습과 추론의 비용 효율성을 끌어올렸다. 엔비디아는 모델뿐 아니라 3조 토큰 규모의 학습·후처리·RL 데이터셋, 에이전틱 안전 데이터, 그리고 네모 짐과 네모 RL, 네모 이밸류에이터(Evaluator)도 공개했다. 이를 통해 개발자와 기업은 실제 에이전트 작업 환경에서 모델을 학습하고 검증하고 확장할 수 있으며, 도메인 특화 AI 에이전트를 직접 구축할 수 있다고 강조했다. 네모트론 3의 가중치를 허깅페이스 에 공개하고, 사전 훈련과 사후 훈련 데이터셋과 학습 레시피도 깃허브 를 통해 제공했다. 이처럼 엔비디아는 하이퍼스케일러나 첨단 AI 기업 외에도 많은 기업과 개발자, 국가들이 GPU를 활용하도록 오픈 소스 모델 출시에도 적극적이다. 특히 최근에는 중국 오픈 소스가 주를 이루고 이를 사용하는 것에 대한 위험 부담이 지적되자, 직접 오픈 모델 개발과 배포에도 힘을 싣고 있다. 박찬 기자 cpark@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204825",
  "article_id": "b89200",
  "cached_at": "2025-12-17T15:04:49.828937+00:00",
  "version": "V1.0"
}