{
  "title": "원전은 유연하게, 재생은 싸게…기후부, '차세대 에너지 운영체계'",
  "summary": "출범 두 달째를 맞은 기후에너지환경부가 한국 에너지 시스템의 재설계를 본격화하고 있다. 원전·재생에너지·산업 경쟁력·탄소감축을 하나의 정책 축으로 묶는 구조 속에서 기후부는 &quot;원전은 유연하게, 재생은 저렴하게&quot;라는 새 원칙을 제시했다.기후부는 중장기 전원 구성으로 원전 30%, 재생 30%대라는 이원적 청정전원 모델을 제시했다. 그러나 원전은 경직된 전원, 재생은 간헐적 전원이라는 특성 차이 때문에 조정 가능성 확보가 핵심 과제가 된다.2030년 전후 예상되는 재생발전 과잉 시나리오에 대비해 기후부는 원전 출력 조절 기술 실증을 서",
  "published_at": "2025-12-05T18:19:05+09:00",
  "modified_at": "2025-12-05T18:19:05+09:00",
  "author": [
    "양준석 기자"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204550_205801_1426.jpg",
  "text": "출범 두 달째를 맞은 기후에너지환경부가 한국 에너지 시스템의 재설계를 본격화하고 있다. 원전·재생에너지·산업 경쟁력·탄소감축을 하나의 정책 축으로 묶는 구조 속에서 기후부는 \"원전은 유연하게, 재생은 저렴하게\"라는 새 원칙을 제시했다. 김성환 기후에너지환경부 장관이 지난 1일 세종시 정부세종청사에서 열린 출입기자간담회에서 주요 정책과 현안을 설명하고 있다. (사진=기후에너지환경부) 기후부는 중장기 전원 구성으로 원전 30%, 재생 30%대라는 이원적 청정전원 모델을 제시했다. 그러나 원전은 경직된 전원, 재생은 간헐적 전원이라는 특성 차이 때문에 조정 가능성 확보가 핵심 과제가 된다. 2030년 전후 예상되는 재생발전 과잉 시나리오에 대비해 기후부는 원전 출력 조절 기술 실증을 서두르고 있다. 이는 원전을 기저전원에서 '조정형 전원'으로 재규정하는 흐름이다. 태양광·풍력 입찰가가 각각 150원대, 160원대까지 내려오면서 정부는 육상풍력을 기준으로 '150원 이하' 목표를 검토 중이다. 이는 ▸전기요금 안정성 ▸탄소감축 비용 절감 ▸재생산업 재편을 동시에 겨냥한 전략이다. 국제 에가 안정되며 한전 재무 여건이 개선된 점도 정책 추진력으로 작용하고 있다. 재생에너지 비중 확대에 따라 전력 안정성을 위한 백업 전원 체계도 재정비되고 있다. 기후부가 제시한 축은 ▸원전 유연운전 기술(2030년대 상용화) ▸ESS 가격 하락 기반 확대 ▸양수발전 신규 후보지 확보 ▸그린수소의 장기 대체 전원화 등이다. 이는 재생·원전 중심의 전원 체계에 '보완 생태계'를 구축하는 과정으로 해석된다. 신규 원전 2기·SMR…확정 계획 vs 실험적 도입 대형 원전 2기의 건설 여부는 올해 공론화 절차가 시작된다. 반면 SMR은 실증 중심의 실험적 도입으로, 2035년 첫 발전을 목표로 한다. 즉, 대형 원전은 시스템의 '무게 중심', SMR은 '미래 옵션 확장'이라는 역할 분담이 분명해지고 있다. 철강(수소환원제철), 석화·시멘트(CCUS), 수송(전기·수소·암모니아 기반 R&D), 선박전환 등 산업별 감축 전략도 재가동된다. 여러 부처가 얽힌 구조적 문제를 해결하기 위해 기후부는 부처 간 이행 점검 체계를 강화하겠다는 입장을 밝혔다. 결국 기후부가 추진하는 변화는 단순한 부처 통합이나 에너지 정책 조정이 아니다. ▸재생 단가 경쟁력 ▸원전 유연성 ▸백업 전원 생태계 ▸산업 감축 구조 ▸요금 안정성 등 이 모든 요소가 맞물린 '한국형 차세대 에너지 운영체계' 재구축 프로젝트다. 기후부는 지금 한국 에너지 전환의 3세대 구조를 설계하는 중이며, 실제 시스템 변화가 국가 경쟁력을 좌우하는 결정적 분기점이 될 것이다. 양준석 기자 kailas21@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204550",
  "article_id": "ca66b5",
  "cached_at": "2025-12-17T15:06:41.083569+00:00",
  "version": "V1.0"
}