{
  "title": "전남 1호 데이터센터, 장성에서 첫 삽",
  "summary": "전라남도가 인공지능(AI) 중심 첨단산업 육성을 위한 핵심 인프라 구축에 본격 착수했다.전남도는 15일 장성 남면 첨단 3지구에서 '전남 제1호 데이터센터'인 장성 파인데이터센터 착공식을 열고, AI 산업 전진기지로 도약하기 위한 첫발을 내디뎠다.이번 착공은 정부의 데이터센터 수도권 집중 완화 정책 이후 체결된 첫 업무협약(MOU) 사업이 실제 투자·건설로 이어진 사례라는 점에서 상징성과 정책적 의미가 크다. 수도권에 집중됐던 데이터 인프라가 지방으로 분산되는 구조적 전환의 출발점이자, 전남이 AI 산업의 실질적 거점으로 자리매김하",
  "published_at": "2025-12-15T14:23:12+09:00",
  "modified_at": "2025-12-15T14:23:12+09:00",
  "author": [
    "양준석 기자"
  ],
  "image": "https://cdn.aitimes.com/news/photo/202512/204803_206171_225.jpg",
  "text": "전라남도가 인공지능(AI) 중심 첨단산업 육성을 위한 핵심 인프라 구축에 본격 착수했다. 전남도는 15일 장성 남면 첨단 3지구에서 '전남 제1호 데이터센터'인 장성 파인데이터센터 착공식을 열고, AI 산업 전진기지로 도약하기 위한 첫발을 내디뎠다. 김영록 전라남도지사가 15일 장성 남면에서 열린 '전남 1호 데이터센터, 장성 파인데이터센터 착공식'에 참석해 주요 내빈과 착공 퍼포먼스를 하고 있다. (사진=전남도) 이번 착공은 정부의 데이터센터 수도권 집중 완화 정책 이후 체결된 첫 업무협약(MOU) 사업이 실제 투자·건설로 이어진 사례라는 점에서 상징성과 정책적 의미가 크다. 수도권에 집중됐던 데이터 인프라가 지방으로 분산되는 구조적 전환의 출발점이자, 전남이 AI 산업의 실질적 거점으로 자리매김하는 신호탄으로 평가된다. 장성 파인데이터센터는 총사업비 3,959억 원을 투입해 26MW급 데이터센터 1기를 우선 구축하고, 향후 60MW급까지 단계적으로 확장하는 대규모 프로젝트다. 센터는 2028년 2월 준공, 같은 해 3월부터 본격 운영에 들어갈 예정이다. 이 사업은 2023년 정부의 데이터센터 분산 정책 발표 이후 체결된 첫 MOU 사업으로, 전남도는 협약 체결 이후 투자사와 긴밀한 협업 체계를 구축하며 각종 인허가와 행정 지원을 지속해 왔다. 그 결과 산업단지 환경개선 펀드와 지역활성화 투자 펀드에 연이어 선정되며 사업 안정성과 투자 신뢰도를 동시에 확보했다. 센터 가동이 본격화되면 빅테크 기업의 전남 유입과 함께 추가적인 데이터센터 구축 문의도 잇따를 것으로 기대된다. 전남도는 이를 계기로 지역 산업 구조에 맞춘 AI 전환(AX)과 AI 기업 육성을 핵심 축으로 한 권역별 AI 혁신생태계를 단계적으로 구축할 방침이다. 특히 최근 국가 AI 컴퓨팅센터, 오픈AI-SK 합동 글로벌 데이터센터 설립이 잇따라 확정되면서, 전남은 아시아·태평양 AI 허브로 도약할 수 있는 전략적 입지를 갖추게 됐다. 이는 단순한 데이터센터 유치를 넘어, 글로벌 AI 산업 가치사슬에 전남이 직접 참여하는 기반이 될 전망이다. 지역과 함께 성장하는 데이터센터…상생 모델 구현 장성 파인데이터센터는 지역과의 동반 성장을 핵심 가치로 삼고 있다. 센터 내에는 400평 규모의 창업지원센터를 조성해 스타트업 공유 오피스를 제공하고, AI·클라우드 분야 전문 교육 프로그램을 운영할 계획이다. 또한 부지 내 공터에는 풋살장 등 생활체육시설을 조성·개방해 주민들이 함께 이용할 수 있도록 하는 등, 데이터센터가 지역사회와 자연스럽게 공존하는 상생형 인프라 모델을 구현할 예정이다. 이번 성과는 전남도가 2019년 '블루이코노미 비전' 선포 이후 태양광·해상풍력 등 신재생에너지 기반 첨단산업 유치 전략을 일관되게 추진해 온 결과로 평가된다. 이는 RE100, 에너지 대전환이라는 글로벌 흐름과 맞물리며 전남의 경쟁력을 한층 끌어올리고 있다. 김영록 전남도지사는 착공식에서 \"많은 빅테크 기업이 전남에 AI 데이터센터 입지를 타진하고 있고, 첨단 반도체 산업까지 유치할 수 있는 여건이 조성되고 있다\"며, \"한쪽에는 농수산업을, 다른 한쪽에는 첨단산업을 육성하는 양수겸장 전략으로 대한민국의 균형 발전을 이끌겠다\"고 강조했다. 장성 파인데이터센터 착공은 단순한 시설 건설을 넘어, 전남 산업 구조 전환과 미래 성장 전략의 출발점이라는 점에서 의미가 깊다. 수도권 중심의 데이터·AI 인프라 구조를 분산시키고, 재생에너지 기반의 지속가능한 AI 산업 모델을 제시함으로써 전남은 향후 국가 AI 정책의 핵심 파트너로 부상할 가능성이 크다. 전남도는 이번 착공을 계기로 데이터센터-AI 기업-스타트업-지역 산업이 유기적으로 연결되는 전남형 AI 혁신 생태계를 완성해 나간다는 구상이다. 이는 지역 경제 활성화는 물론, 대한민국 전체의 디지털 경쟁력을 한 단계 끌어올리는 중요한 이정표가 될 것으로 기대된다. 양준석 기자 kailas21@aitimes.com",
  "url": "https://www.aitimes.com/news/articleView.html?idxno=204803",
  "article_id": "e222fb",
  "cached_at": "2025-12-17T15:06:10.397651+00:00",
  "version": "V1.0"
}