{
  "_header": {
    "version": "3.0",
    "article_id": "c9a4ad3192ab",
    "state": "COLLECTED",
    "state_history": [
      {
        "state": "COLLECTED",
        "at": "2025-12-30T04:11:03.397060+09:00",
        "by": "crawler"
      }
    ]
  },
  "_original": {
    "title": "‘죽은 바닷가재’로 만든 로봇 팔 등장...\"네크로보틱스의 좋은 예\" - AI타임스",
    "description": "스위스 과학자들이 죽은 바닷가재의 신체 일부를 로봇 부품으로 재활용하는 데 성공했다. 해양 갑각류의 가볍고 강하면서도 유연한 외골격을 로봇 팔과 그리퍼(gripp",
    "image": "https://cdn.aitimes.com/news/photo/202512/205153_206694_5431.png",
    "text": "스위스 과학자들이 죽은 바닷가재의 신체 일부를 로봇 부품으로 재활용하는 데 성공했다. 해양 갑각류의 가볍고 강하면서도 유연한 외골격을 로봇 팔과 그리퍼(grippers), 수중 추진 장치로 활용한 것으로, 식품 산업에서 버려지는 껍질을 이용한 지속가능한 ‘네크로보틱스(necrobotics)’의 새로운 사례로 주목받고 있다. 스위스 연방공과대학 로잔(EPFL) 연구진은 26일(현지시간) 노르웨이 랍스터(Norway lobster)로 불리는 '랑구스틴(langoustine)'의 꼬리 외골격을 로봇 부품으로 재활용하는 실험 결과를 공개했다. 연구진은 랍스터의 외골격이 초당 최대 8회까지 자연스럽게 굽혀지며, 로봇용 그리퍼와 매니퓰레이터(manipulators)는 물론, 수영·추진용 플래퍼(flappers)로도 활용 가능하다는 점을 확인했다. 특히 무게는 3g에 불과하지만, 최대 680g에 달하는 하중을 견뎌냈다. 자연을 모방하는 데서 한 걸음 더 나아가, 이미 자연이 완성해 둔 구조를 직접 활용한 사례다. 이를 '생체 하이브리드 로봇 공학'으로도 부른다. 연구진은 “갑각류 외골격은 광물화된 껍질과 관절막이 결합해 강도와 유연성의 균형을 이룬다”라며 “물속에서의 고토크·고속 움직임을 가능하게 하는 이 구조는 로봇공학에서도 매우 유용하다”라고 설명했다. 이어 “식품 폐기물을 재활용함으로써, 재사용과 순환을 전제로 한 지속가능한 설계가 가능하다”라고 덧붙였다. 영상에서는 랑구스틴 꼬리 두개가 로봇 그리퍼처럼 토마토와 같은 연약한 물체를 손상 없이 집어 올리는 장면이 공개됐다. 또 공기 중에서는 빠른 플래핑 동작을, 물속에서는 효율적인 추진 움직임을 구현해 생물학적 구조의 우수성을 그대로 보여줬다. (사진=EPFL) 핵심 소재는 키틴(chitin)이다. 키틴은 갑각류와 곤충의 외골격을 이루는 천연 고분자로, 가볍고 강하며 유연한 동시에 생분해성과 생체적합성을 갖춘다. 연구진은 외골격의 내구성과 수명을 늘리기 위해 실리콘 코팅을 추가했고, 내부에는 엘라스토머를 삽입해 모터 구동부와 연결했다. 연구진은 “식품 폐기물을 로봇 시스템에 통합해 지속가능한 설계와 재사용·재활용을 결합한 개념 증명은 우리가 처음”이라고 강조했다. 앞으로는 생물 구조마다 다른 자연적 편차를 보정할 수 있도록 조절형 컨트롤러 등 진보된 합성 보강 기술을 적용할 계획이다. 이번 연구는 ‘자연이 여전히 많은 인공 시스템을 능가한다’는 점을 보여준 것으로 평가된다. 이전에는 죽은 모기의 침을 초미세 3D 프린터 노즐로 활용한 사례나 죽은 거미를 로봇 집게로 활용한 사례 등이 알려진 바 있다. 이처럼, 동물의 사체를 활용한 네크로보틱스는 로봇공학의 새로운 축으로 자리 잡고 있다는 평이다. 박찬 기자 cpark@aitimes.com",
    "published_at": "2025-12-29T18:00:00+09:00",
    "url": "https://www.aitimes.com/news/articleView.html?idxno=205153",
    "source_id": "aitimes",
    "crawled_at": "2025-12-30T04:11:03.397060+09:00"
  },
  "_analysis": {},
  "_classification": {},
  "_publication": {}
}