{
  "_header": {
    "version": "3.0",
    "article_id": "d803bb6b0bac",
    "state": "COLLECTED",
    "state_history": [
      {
        "state": "COLLECTED",
        "at": "2025-12-30T04:11:09.838516+09:00",
        "by": "crawler"
      }
    ]
  },
  "_original": {
    "title": "Inside Microsoft Ignite: How Microsoft and NVIDIA are redefining the AI stack",
    "description": "As the world’s leading platform providers and champions for advancing AI globally, NVIDIA and Microsoft continue to deliver unequaled value for organizations investing in and deploying AI.",
    "image": "https://images.ctfassets.net/jdtwqhzvc2n1/5saN39AIaBHdzXvxzFIskd/a47daf35dddd9da13b6afea6cfb1c803/VB-NVIDIA-Ignite-Article-D-updated.jpg?w=800&q=75",
    "text": "Presented by Microsoft and NVIDIA As the world’s leading platform providers and champions for advancing AI globally, NVIDIA and Microsoft continue to deliver unequaled value for organizations investing in and deploying AI. The companies’ collaborative efforts at the 2025 Microsoft Ignite conference offered tangible proof, introducing practitioners and decision-makers to new and expanded AI infrastructure and cloud solutions for accelerating enterprise transformation and real-world impact with AI agents. IT and business leaders across industries gathered at Microsoft Ignite, November 18 to 21 in San Francisco. The theme for this year’s conference centered on accelerating success with AI, with a strong topical focus around developing and scaling agentic and physical AI and digital twins. NVIDIA and Microsoft event presence underscored the expansive nature of their collaboration, from silicon to services, as attendees experienced first-hand the full-stack AI solutions now available and heard exciting announcements on new integrations and expanded partnership solutions. NVIDIA sessions from Microsoft Ignite — available on demand Learning sessions at Microsoft Ignite are tailored each year to deliver timely technical and strategic insights for attendees across roles. In-depth learning on the powerful integrations between Microsoft Azure and the NVIDIA platform made up a sizable quotient of this year’s catalog, with over 40 sessions highlighting NVIDIA solutions and capabilities. Now, 15 of these sessions are available on demand for a limited time. Available sessions cover many of the latest integrations available from NVIDIA and Microsoft Azure — some so recent as to be announced during the event. For in-person session attendees and post-event viewers leveraging the on-demand catalog, NVIDIA’s and Microsoft’s presentations during Microsoft Ignite engage customers with the most up-to-date information on what they can get from Microsoft Azure, with NVIDIA integrations to power and elevate their AI journeys. Integrations for next-generation AI NVIDIA Blackwell powers Azure NCv6 for accelerating complex AI workloads NVIDIA continues to evolve its Blackwell platform for the AI era as a new NVIDIA Blackwell platform expansion brings the new Azure NCv6 Series Virtual Machines with NVIDIA RTX PRO 6000 Blackwell GPUs into public preview. This expansion allows the Blackwell platform to right-size acceleration for converged AI and visual computing workloads spanning digital twins and NVIDIA Omniverse simulation, agentic AI, 3D rendering, LLM inference and retrieval-augmented generation (RAG) on small-to-medium models, and scientific visualization. Ultimately, this solution offers customers a seamless upgrade path, enabling Blackwell performance that supports complex AI tasks with greater efficiency. NVIDIA Omniverse libraries are also now available on Microsoft Azure. These solutions, together with Azure Local for deployment, create unparalleled flexibility and unification from edge to cloud for enterprises looking to develop, deploy, and manage innovative AI solutions for transforming industrial workflows. NVIDIA Omniverse technology on Azure featured heavily at Ignite — NVIDIA, Microsoft, and Ansys convened for the session “Transform manufacturing with digital twins and real-time simulation,” available now on demand, discussing how Omniverse, along with other NVIDIA solutions on Azure, helps accelerate time to insight and optimize manufacturing processes. For more on NVIDIA Blackwell architecture integration with Microsoft Azure and purpose-built capabilities for a wide range of use cases, watch the on-demand session “Power next-generation AI workloads with NVIDIA Blackwell on Azure.” Learn about benefits in cost and energy efficiency, innovative developer tools from NVIDIA, and case studies showcasing the powerful synergy between NVIDIA and Microsoft Azure for customers. You can also watch Microsoft’s session “What’s new in Azure Local” to learn more about integration with NVIDIA RTX PRO 6000 GPUs for computing at the edge. Microsoft Agent 365 with NVIDIA NeMo Agent Toolkit elevates agentic AI utility As agentic AI’s prominence in the workplace continues to grow, Microsoft and NVIDIA are elevating the utility of workplace agents with integration between the NVIDIA NeMo Agent Toolkit and Microsoft Agent 365. This integration allows developers to create and deliver compliant, secure, and tailored workplace agents across Microsoft 365 productivity apps including Outlook, Teams, Word, and SharePoint, empowering customers with tailored agents built to meet their organizations’ unique needs. Microsoft Foundry has also made NVIDIA Nemotron models available as secure NVIDIA NIM microservices to power these new enterprise agents and other digital AI. NVIDIA Cosmos models are available for powering physical AI. These models will enable developers to build enterprise-grade agents with capabilities spanning multimodal intelligence and multilingual reasoning, math, coding, and more. More on NVIDIA’s enterprise strategy and core technologies enabling the promise of agentic AI is available in the NVIDIA Ignite presentation “From prompt to production: Scale agentic AI with NVIDIA and Azure.” Solutions covered include NVIDIA NIM microservices, NVIDIA NeMo Agent Toolkit, NVIDIA CUDA libraries, and the Nemotron model family. SQL Server integrations enable AI-ready enterprise databases NVIDIA and Microsoft integrations also offer a new solution for building scalable AI on enterprise data. SQL Server 2025 now connects with NVIDIA Nemotron RAG models deployed as NVIDIA NIM microservices. With this integration, customers can streamline AI deployment, overcoming major hurdles in data volumes, data privacy, and security and avoiding the bottlenecks associated with traditional CPU infrastructure. With GPU-accelerated RAG workflows implemented on Azure Cloud or Azure Local, organizations can build high-performance, secure AI applications wherever their data lives, whether in the cloud or on-premises — while preserving full data sovereignty. This integration makes it easy to bring AI directly to the data, without the complexity of managing data pipelines. Watch NVIDIA sessions from Microsoft Ignite now Learn more about the integrations between NVIDIA and Microsoft technologies and see how frontier firms are driving success with real-world AI use cases. Explore these topics further in the many additional on-demand NVIDIA sessions available from Microsoft Ignite. Topics include agentic AI, robotics simulation, and infrastructure for AI workloads. These sessions will only be available for a limited time, so watch the presentations that match your interests now. Browse available sessions in the catalog here.",
    "published_at": "2025-12-29T00:00:00-05:00",
    "url": "https://venturebeat.com/infrastructure/inside-microsoft-ignite-how-microsoft-and-nvidia-are-redefining-the-ai-stack",
    "source_id": "venturebeat",
    "crawled_at": "2025-12-30T04:11:09.838516+09:00"
  },
  "_analysis": {},
  "_classification": {},
  "_publication": {}
}