{
  "article_id": "d998e3",
  "author": "Michael Nuñez",
  "cached_at": "2025-12-19T18:10:43.804314+00:00",
  "image": "https://images.ctfassets.net/jdtwqhzvc2n1/J3NYgqu1RNo5JeiBlj7Vc/a01c1b4c38ac8f0ba4ec1feb781c5333/nuneybits_Vector_art_of_retro_computer_screen_scrolling_code_fo_392f32d5-c9a7-4acb-8276-6336ec58d7a4.webp?w=800&amp;q=75",
  "modified_at": "2025-12-19T13:43:01.553Z",
  "summary": "Anthropic이 'Agent Skills' 기술을 오픈 표준으로 공개하고 Atlassian, Figma, Stripe 등과 협력하여 생태계 확장에 나섰다. 이는 AI에게 특정 작업을 수행하는 절차적 지식을 제공하는 기술로, 기업 고객을 위한 관리 도구와 함께 제공된다. OpenAI와의 경쟁에서 폐쇄적 생태계 대신 개방형 표준 전략을 택했다.",
  "text": "Anthropic said on Wednesday it would release its Agent Skills technology as an open standard, a strategic bet that sharing its approach to making AI assistants more capable will cement the company's position in the fast-evolving enterprise software market. The San Francisco-based artificial intelligence company also unveiled organization-wide management tools for enterprise customers and a directory of partner-built skills from companies including Atlassian, Figma, Canva, Stripe, Notion, and Zapier. The moves mark a significant expansion of a technology Anthropic first introduced in October, transforming what began as a niche developer feature into infrastructure that now appears poised to become an industry standard. \"We're launching Agent Skills as an independent open standard with a specification and reference SDK available at https://agentskills.io,\" Mahesh Murag, a product manager at Anthropic, said in an interview with VentureBeat. \"Microsoft has already adopted Agent Skills within VS Code and GitHub; so have popular coding agents like Cursor, Goose, Amp, OpenCode, and more. We're in active conversations with others across the ecosystem.\" Inside the technology that teaches AI assistants to do specialized work Skills are, at their core, folders containing instructions, scripts, and resources that tell AI systems how to perform specific tasks consistently. Rather than requiring users to craft elaborate prompts each time they want an AI assistant to complete a specialized task, skills package that procedural knowledge into reusable modules. The concept addresses a fundamental limitation of large language models: while they possess broad general knowledge, they often lack the specific procedural expertise needed for specialized professional work. A skill for creating PowerPoint presentations, for instance, might include preferred formatting conventions, slide structure guidelines, and quality standards — information the AI loads only when working on presentations. Anthropic designed the system around what it calls \"progressive disclosure.\" Each skill takes only a few dozen tokens when summarized in the AI's context window, with full details loading only when the task requires them. This architectural choice allows organizations to deploy extensive skill libraries without overwhelming the AI's working memory. Fortune 500 companies are already using skills in legal, finance, and accounting The new enterprise management features allow administrators on Anthropic's Team and Enterprise plans to provision skills centrally, controlling which workflows are available across their organizations while letting individual employees customize their experience. \"Enterprise customers are using skills in production across both coding workflows and business functions like legal, finance, accounting, and data science,\" Murag said. \"The feedback has been positive because skills let them personalize Claude to how they actually work and get to high-quality output faster.\" The community response has exceeded expectations, according to Murag: \"Our skills repository already crossed 20k stars on GitHub, with tens of thousands of community-created and shared skills.\" Atlassian, Figma, Stripe, and Zapier join Anthropic's skills directory at launch Anthropic is launching with skills from ten partners, a roster that reads like a who's who of modern enterprise software. The presence of Atlassian, which makes Jira and Confluence, alongside design tools Figma and Canva, payment infrastructure company Stripe, and automation platform Zapier suggests Anthropic is positioning Skills as connective tissue between Claude and the applications businesses already use. The business arrangements with these partners focus on ecosystem development rather than immediate revenue generation. \"Partners who build skills for the directory do so to enhance how Claude works with their platforms. It's a mutually beneficial ecosystem relationship similar to MCP connector partnerships,\" Murag explained. \"There are no revenue-sharing arrangements at this time.\" For vetting new partners, Anthropic is taking a measured approach. \"We began with established partners and are developing more formal criteria as we expand,\" Murag said. \"We want to create a valuable supply of skills for enterprises while helping partner products shine.\" Notably, Anthropic is not charging extra for the capability. \"Skills work across all Claude surfaces: Claude.ai, Claude Code, the Claude Agent SDK, and the API. They're included in Max, Pro, Team, and Enterprise plans at no additional cost. API usage follows standard API pricing,\" Murag said. Why Anthropic is giving away its competitive advantage to OpenAI and Google The decision to release Skills as an open standard is a calculated strategic choice. By making skills portable across AI platforms, Anthropic is betting that ecosystem growth will benefit the company more than proprietary lock-in would. The strategy appears to be working. OpenAI has quietly adopted structurally identical architecture in both ChatGPT and its Codex CLI tool. Developer Elias Judin discovered the implementation earlier this month, finding directories containing skill files that mirror Anthropic's specification—the same file naming conventions, the same metadata format, the same directory organization. This convergence suggests the industry has found a common answer to a vexing question: how do you make AI assistants consistently good at specialized work without expensive model fine-tuning? The timing aligns with broader standardization efforts in the AI industry. Anthropic donated its Model Context Protocol to the Linux Foundation on December 9, and both Anthropic and OpenAI co-founded the Agentic AI Foundation alongside Block. Google, Microsoft, and Amazon Web Services joined as members. The foundation will steward multiple open specifications, and Skills fit naturally into this standardization push. \"We've also seen how complementary skills and MCP servers are,\" Murag noted. \"MCP provides secure connectivity to external software and data, while skills provide the procedural knowledge for using those tools effectively. Partners who've invested in strong MCP integrations were a natural starting point.\" The AI industry abandons specialized agents in favor of one assistant that learns everything The Skills approach is a philosophical shift in how the AI industry thinks about making AI assistants more capable. The traditional approach involved building specialized agents for different use cases — a customer service agent, a coding agent, a research agent. Skills suggest a different model: one general-purpose agent equipped with a library of specialized capabilities. \"We used to think agents in different domains will look very different,\" Barry Zhang, an Anthropic researcher, said at an industry conference last month, according to a Business Insider report. \"The agent underneath is actually more universal than we thought.\" This insight has significant implications for enterprise software development. Rather than building and maintaining multiple specialized AI systems, organizations can invest in creating and curating skills that encode their institutional knowledge and best practices. Anthropic's own internal research supports this approach. A study the company published in early December found that its engineers used Claude in 60% of their work, achieving a 50% self-reported productivity boost—a two to threefold increase from the prior year. Notably, 27% of Claude-assisted work consisted of tasks that would not have been done otherwise, including building internal tools, creating documentation, and addressing what employees called \"papercuts\" — small quality-of-life improvements that had been perpetually deprioritized. Security risks and skill atrophy emerge as concerns for enterprise AI deployments The Skills framework is not without potential complications. As AI systems become more capable through skills, questions arise about maintaining human expertise. Anthropic's internal research found that while skills enabled engineers to work across more domains—backend developers building user interfaces, researchers creating data visualizations—some employees worried about skill atrophy. \"When producing output is so easy and fast, it gets harder and harder to actually take the time to learn something,\" one Anthropic engineer said in the company's internal survey. There are also security considerations. Skills provide Claude with new capabilities through instructions and code, which means malicious skills could theoretically introduce vulnerabilities. Anthropic recommends installing skills only from trusted sources and thoroughly auditing those from less-trusted origins. The open standard approach introduces governance questions as well. While Anthropic has published the specification and launched a reference SDK, the long-term stewardship of the standard remains undefined. Whether it will fall under the Agentic AI Foundation or require its own governance structure is an open question. Anthropic's real product may not be Claude—it may be the infrastructure everyone else builds on The trajectory of Skills reveals something important about Anthropic's ambitions. Two months ago, the company introduced a feature that looked like a developer tool. Today, that feature has become a specification that Microsoft builds into VS Code, that OpenAI replicates in ChatGPT, and that enterprise software giants race to support. The pattern echoes strategies that have reshaped the technology industry before. Companies from Red Hat to Google have discovered that open standards can be more valuable than proprietary technology — that the company defining how an industry works often captures more value than the company trying to own it outright. For enterprise technology leaders evaluating AI investments, the message is straightforward: skills are becoming infrastructure. The expertise organizations encode into skills today will determine how effectively their AI assistants perform tomorrow, regardless of which model powers them. The competitive battles between Anthropic, OpenAI, and Google will continue. But on the question of how to make AI assistants reliably good at specialized work, the industry has quietly converged on an answer — and it came from the company that gave it away.",
  "title": "Anthropic launches enterprise ‘Agent Skills’ and opens the standard, challenging OpenAI in workplace AI",
  "url": "https://venturebeat.com/technology/anthropic-launches-enterprise-agent-skills-and-opens-the-standard",
  "title_ko": "Anthropic, 기업용 'Agent Skills' 출시 및 표준 개방... OpenAI에 도전장",
  "tags": [],
  "impact_score": 6.0,
  "IS_Analysis": {
    "Score_Commentary": "Tier 2 기업이 '오픈 표준'을 통해 산업 전반의 인프라(X3)를 변경하려는 시도로 영향력이 크다. 다수의 Tier 2/3 파트너(Atlassian 등)와의 협력은 전략적 중요도(C2)를 높인다.",
    "Calculations": {
      "IW_Analysis": {
        "Inputs": {
          "Pe_Selection_Rule": "P4",
          "Pe_Entity_Name": "Anthropic",
          "Pe_Tier": 2,
          "Se_Entity_Name": "Atlassian",
          "Se_Tier": 3,
          "PE/SE_Reason": "실행 주체는 Anthropic(P4). 파트너사 중 대표 격인 Atlassian을 협력관계(상호 호혜) SE로 선정."
        },
        "Tier_Score": 2,
        "Gap_Score": 0,
        "IW_Score": 2
      },
      "IE_Analysis": {
        "Inputs": {
          "X_Magnitude_Code": 3,
          "Y_Evidence_Code": 3,
          "Scope_Matrix_Score": 2.5,
          "Criticality_C1_Provenness": 1,
          "Criticality_C2_Societal_Weight": 0.5,
          "Criticality_Total": 1.5,
          "SOTA_Check_Result": "False"
        },
        "IE_Score": 4
      }
    }
  },
  "zero_echo_score": 4.4,
  "ZES_Raw_Metrics": {
    "Signal": {
      "T1": 7,
      "T2": 7,
      "T3": 6,
      "Rationale": "토큰 사용량, 표준화 방식 등 구체적 메커니즘 설명."
    },
    "Noise": {
      "P1": 3,
      "P2": 3,
      "P3": 2,
      "Rationale": "전략적 의도 설명이 명확하며 과장된 표현이 적음."
    },
    "Utility": {
      "V1": 8,
      "V2": 8,
      "V3": 6,
      "Rationale": "GitHub 등에서 즉시 사용 가능한 오픈 표준으로 효용성 높음."
    },
    "Fine_Adjustment": {
      "Score": 0.5,
      "Reason": "생태계 표준화 시도는 장기적 파급력이 크므로 가산점 부여."
    }
  },
  "schema_version": "V1.0",
  "raw_analysis": {
    "Article_ID": "d998e3",
    "Meta": {
      "Specification_Version": "v 1.0.0",
      "Headline": "Anthropic, 기업용 'Agent Skills' 출시 및 표준 개방... OpenAI에 도전장",
      "Summary": "Anthropic이 'Agent Skills' 기술을 오픈 표준으로 공개하고 Atlassian, Figma, Stripe 등과 협력하여 생태계 확장에 나섰다. 이는 AI에게 특정 작업을 수행하는 절차적 지식을 제공하는 기술로, 기업 고객을 위한 관리 도구와 함께 제공된다. OpenAI와의 경쟁에서 폐쇄적 생태계 대신 개방형 표준 전략을 택했다.",
      "Tags": "Launch, Agent, Open Source"
    },
    "IS_Analysis": {
      "Score_Commentary": "Tier 2 기업이 '오픈 표준'을 통해 산업 전반의 인프라(X3)를 변경하려는 시도로 영향력이 크다. 다수의 Tier 2/3 파트너(Atlassian 등)와의 협력은 전략적 중요도(C2)를 높인다.",
      "Calculations": {
        "IW_Analysis": {
          "Inputs": {
            "Pe_Selection_Rule": "P4",
            "Pe_Entity_Name": "Anthropic",
            "Pe_Tier": 2,
            "Se_Entity_Name": "Atlassian",
            "Se_Tier": 3,
            "PE/SE_Reason": "실행 주체는 Anthropic(P4). 파트너사 중 대표 격인 Atlassian을 협력관계(상호 호혜) SE로 선정."
          },
          "Tier_Score": 2,
          "Gap_Score": 0,
          "IW_Score": 2
        },
        "IE_Analysis": {
          "Inputs": {
            "X_Magnitude_Code": 3,
            "Y_Evidence_Code": 3,
            "Scope_Matrix_Score": 2.5,
            "Criticality_C1_Provenness": 1,
            "Criticality_C2_Societal_Weight": 0.5,
            "Criticality_Total": 1.5,
            "SOTA_Check_Result": "False"
          },
          "IE_Score": 4
        }
      }
    },
    "ZES_Raw_Metrics": {
      "Signal": {
        "T1": 7,
        "T2": 7,
        "T3": 6,
        "Rationale": "토큰 사용량, 표준화 방식 등 구체적 메커니즘 설명."
      },
      "Noise": {
        "P1": 3,
        "P2": 3,
        "P3": 2,
        "Rationale": "전략적 의도 설명이 명확하며 과장된 표현이 적음."
      },
      "Utility": {
        "V1": 8,
        "V2": 8,
        "V3": 6,
        "Rationale": "GitHub 등에서 즉시 사용 가능한 오픈 표준으로 효용성 높음."
      },
      "Fine_Adjustment": {
        "Score": 0.5,
        "Reason": "생태계 표준화 시도는 장기적 파급력이 크므로 가산점 부여."
      }
    }
  },
  "source_id": "venturebeat",
  "original_title": "Anthropic launches enterprise ‘Agent Skills’ and opens the standard, challenging OpenAI in workplace AI",
  "evidence": {
    "breakdown": {
      "Signal": {
        "T1": 7.0,
        "T2": 7.0,
        "T3": 6.0,
        "S_Avg": 6.67
      },
      "Noise": {
        "P1": 3.0,
        "P2": 3.0,
        "P3": 2.0,
        "N_Avg": 2.67
      },
      "Utility": {
        "V1": 8.0,
        "V2": 8.0,
        "V3": 6.0,
        "U_Avg": 7.33
      },
      "Fine_Adjustment": 0.5,
      "ZS_Raw": 4.37,
      "ZS_Final": 4.4
    },
    "raw_metrics": {
      "Signal": {
        "T1": 7,
        "T2": 7,
        "T3": 6,
        "Rationale": "토큰 사용량, 표준화 방식 등 구체적 메커니즘 설명."
      },
      "Noise": {
        "P1": 3,
        "P2": 3,
        "P3": 2,
        "Rationale": "전략적 의도 설명이 명확하며 과장된 표현이 적음."
      },
      "Utility": {
        "V1": 8,
        "V2": 8,
        "V3": 6,
        "Rationale": "GitHub 등에서 즉시 사용 가능한 오픈 표준으로 효용성 높음."
      },
      "Fine_Adjustment": {
        "Score": 0.5,
        "Reason": "생태계 표준화 시도는 장기적 파급력이 크므로 가산점 부여."
      }
    }
  },
  "impact_evidence": {
    "calculations": {
      "IW_Analysis": {
        "Tier_Score": 2.0,
        "Gap_Score": 0.0,
        "IW_Total": 2.0
      },
      "IE_Analysis": {
        "Scope_Total": 2.5,
        "Criticality_Total": 1.5,
        "IE_Total": 4.0
      },
      "IS_Raw": 6.0,
      "IS_Final": 6.0,
      "Score_Commentary": "Tier 2 기업이 '오픈 표준'을 통해 산업 전반의 인프라(X3)를 변경하려는 시도로 영향력이 크다. 다수의 Tier 2/3 파트너(Atlassian 등)와의 협력은 전략적 중요도(C2)를 높인다."
    },
    "raw_inputs": {
      "Pe_Selection_Rule": "P4",
      "Pe_Entity_Name": "Anthropic",
      "Pe_Tier": 2,
      "Se_Entity_Name": "Atlassian",
      "Se_Tier": 3,
      "PE/SE_Reason": "실행 주체는 Anthropic(P4). 파트너사 중 대표 격인 Atlassian을 협력관계(상호 호혜) SE로 선정."
    },
    "raw_ie_inputs": {
      "X_Magnitude_Code": 3,
      "Y_Evidence_Code": 3,
      "Scope_Matrix_Score": 2.5,
      "Criticality_C1_Provenness": 1,
      "Criticality_C2_Societal_Weight": 0.5,
      "Criticality_Total": 1.5,
      "SOTA_Check_Result": "False"
    },
    "schema_version": "V1.0"
  },
  "crawled_at": "2025-12-19T19:44:06.377015+00:00",
  "edition": "251219_FRI_1",
  "status": "ACCEPTED",
  "saved": true,
  "saved_at": "2025-12-19T19:44:06.787169+00:00",
  "category": "Engineering",
  "dedup_status": "selected",
  "published": true,
  "published_at": "2025-12-19T20:35:10.440706+00:00",
  "data_file": "venturebeat_d998e3.json",
  "synced_to_firebase": true,
  "synced_at": "2025-12-21T16:12:10.645213+00:00"
}