{
  "title": "The 70% factuality ceiling: why Google’s new ‘FACTS’ benchmark is a wake-up call",
  "summary": "The 70% factuality ceiling: why Google’s new ‘FACTS’ benchmark is a wake-up call",
  "published_at": "2025-12-10T18:00-05:00",
  "modified_at": "2025-12-10T23:00:31.046Z",
  "author": "Carl Franzen",
  "image": "https://images.ctfassets.net/jdtwqhzvc2n1/1P96HBSOE22cfl5djgDueT/df9398cb8f464a8f6519d964da86026c/mRfmh7TAQtPYv7mwcN551.png?w=800&amp;q=75",
  "text": "There's no shortage of generative AI benchmarks designed to measure the performance and accuracy of a given model on completing various helpful enterprise tasks — from coding to instruction following to agentic web browsing and tool use. But many of these benchmarks have one major shortcoming: they measure the AI's ability to complete specific problems and requests, not how factual the model is in its outputs — how well it generates objectively correct information tied to real-world data — especially when dealing with information contained in imagery or graphics. For industries where accuracy is paramount — legal, finance, and medical — the lack of a standardized way to measure factuality has been a critical blind spot. That changes today: Google’s FACTS team and its data science unit Kaggle released the FACTS Benchmark Suite, a comprehensive evaluation framework designed to close this gap. The associated research paper reveals a more nuanced definition of the problem, splitting \"factuality\" into two distinct operational scenarios: \"contextual factuality\" (grounding responses in provided data) and \"world knowledge factuality\" (retrieving information from memory or the web). While the headline news is Gemini 3 Pro’s top-tier placement, the deeper story for builders is the industry-wide \"factuality wall.\" According to the initial results, no model—including Gemini 3 Pro, GPT-5, or Claude 4.5 Opus—managed to crack a 70% accuracy score across the suite of problems. For technical leaders, this is a signal: the era of \"trust but verify\" is far from over. Deconstructing the Benchmark The FACTS suite moves beyond simple Q&A. It is composed of four distinct tests, each simulating a different real-world failure mode that developers encounter in production: Parametric Benchmark (Internal Knowledge): Can the model accurately answer trivia-style questions using only its training data? Search Benchmark (Tool Use): Can the model effectively use a web search tool to retrieve and synthesize live information? Multimodal Benchmark (Vision): Can the model accurately interpret charts, diagrams, and images without hallucinating? Grounding Benchmark v2 (Context): Can the model stick strictly to the provided source text? Google has released 3,513 examples to the public, while Kaggle holds a private set to prevent developers from training on the test data—a common issue known as \"contamination.\" The Leaderboard: A Game of Inches The initial run of the benchmark places Gemini 3 Pro in the lead with a comprehensive FACTS Score of 68.8%, followed by Gemini 2.5 Pro (62.1%) and OpenAI’s GPT-5 (61.8%).However, a closer look at the data reveals where the real battlegrounds are for engineering teams. Model FACTS Score (Avg) Search (RAG Capability) Multimodal (Vision) Gemini 3 Pro 68.8 83.8 46.1 Gemini 2.5 Pro 62.1 63.9 46.9 GPT-5 61.8 77.7 44.1 Grok 4 53.6 75.3 25.7 Claude 4.5 Opus 51.3 73.2 39.2 Data sourced from the FACTS Team release notes. For Builders: The \"Search\" vs. \"Parametric\" Gap For developers building RAG (Retrieval-Augmented Generation) systems, the Search Benchmark is the most critical metric. The data shows a massive discrepancy between a model's ability to \"know\" things (Parametric) and its ability to \"find\" things (Search). For instance, Gemini 3 Pro scores a high 83.8% on Search tasks but only 76.4% on Parametric tasks. This validates the current enterprise architecture standard: do not rely on a model's internal memory for critical facts. If you are building an internal knowledge bot, the FACTS results suggest that hooking your model up to a search tool or vector database is not optional—it is the only way to push accuracy toward acceptable production levels. The Multimodal Warning The most alarming data point for product managers is the performance on Multimodal tasks. The scores here are universally low. Even the category leader, Gemini 2.5 Pro, only hit 46.9% accuracy. The benchmark tasks included reading charts, interpreting diagrams, and identifying objects in nature. With less than 50% accuracy across the board, this suggests that Multimodal AI is not yet ready for unsupervised data extraction. Bottom line: If your product roadmap involves having an AI automatically scrape data from invoices or interpret financial charts without human-in-the-loop review, you are likely introducing significant error rates into your pipeline. Why This Matters for Your Stack The FACTS Benchmark is likely to become a standard reference point for procurement. When evaluating models for enterprise use, technical leaders should look beyond the composite score and drill into the specific sub-benchmark that matches their use case: Building a Customer Support Bot? Look at the Grounding score to ensure the bot sticks to your policy documents. (Gemini 2.5 Pro actually outscored Gemini 3 Pro here, 74.2 vs 69.0). Building a Research Assistant? Prioritize Search scores. Building an Image Analysis Tool? Proceed with extreme caution. As the FACTS team noted in their release, \"All evaluated models achieved an overall accuracy below 70%, leaving considerable headroom for future progress.\"For now, the message to the industry is clear: The models are getting smarter, but they aren't yet infallible. Design your systems with the assumption that, roughly one-third of the time, the raw model might just be wrong.",
  "url": "https://venturebeat.com/ai/the-70-factuality-ceiling-why-googles-new-facts-benchmark-is-a-wake-up-call",
  "version": "V1.0"
}