{
  "title": "Pentagon debuts GenAI.mil platform with Google while eyeing rival models",
  "summary": "The US Department of Defense has officially launched \"GenAI.mil,\" a centralized platform designed to give roughly three million civilian and military employees and contractors direct access to generative AI. To kick things off, the system is rolling out Google Cloud's \"Gemini for Government.\"",
  "image": "https://the-decoder.com/wp-content/uploads/2025/12/GenAI.mil-title.png",
  "text": "Max is the managing editor of THE DECODER, bringing his background in philosophy to explore questions of consciousness and whether machines truly think or just pretend to. Content Summary The US Department of Defense has officially launched \"GenAI.mil,\" a centralized platform designed to give roughly three million civilian and military employees and contractors direct access to generative AI. To kick things off, the system is rolling out Google Cloud's \"Gemini for Government.\" Ad According to a report from DefenseScoop, the rollout marks a major shift in the Pentagon's digital strategy. Chief Technology Officer Emil Michael notes that this places AI tools directly on desktops across the entire workforce for the first time. The move aims to spark an \"AI-driven culture change\" and address the technology adoption gaps of the last five years. A multi-vendor approach starts with Google While Google's Gemini leads the launch, the Defense Department emphasizes that this isn't an exclusive partnership. Instead, the Pentagon is pursuing a multi-vendor strategy where Google is simply the first provider hosted on the system. Google likely secured the early spot thanks to its existing certifications for \"Controlled Unclassified Information\" (CUI) and Impact Level 5 (IL5) security clearance—requirements for operational use in sensitive environments. Ad Ad THE DECODER Newsletter The most important AI news straight to your inbox. ✓ Weekly ✓ Free ✓ Cancel at any time Please leave this field empty Other major AI players remain involved. The Pentagon's Chief Digital and Artificial Intelligence Office (CDAO) maintains ongoing contracts with OpenAI, Anthropic, and xAI. According to DefenseScoop, models from these companies will be integrated into the enterprise platform at a later date. Targeting organizational and combat tasks GenAI.mil targets three primary use cases: organizational tasks, intelligence analysis, and warfighting. To ensure reliability, the Google tools employ retrieval-augmented generation (RAG) and connect to Google Search, a setup designed to reduce hallucinations and provide more accurate results. The groundwork for this diversified approach was laid in July, when the CDAO awarded contracts worth up to $200 million each to Google, OpenAI, Anthropic, and xAI. These agreements allow the military to test various \"frontier models\" and agent-based workflows before broader deployment. Ad",
  "published_at": 